<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.5 $ -->
<!-- EN-Revision: 1.18 Maintainer: lboshell Status: ready -->
 <chapter xml:id="faq.mailinglist" xmlns="http://docbook.org/ns/docbook" xmlns:xlink="http://www.w3.org/1999/xlink">
  <title>Listas de correo</title>
  <titleabbrev>Listas de correo</titleabbrev>

   <para>
    Esta secci&oacute;n contiene preguntas sobre c&oacute;mo ponerse
    en contacto con la comunidad de PHP. La mejor manera es a
    trav&eacute;s de las listas de correo.
   </para>

  <qandaset>
   <qandaentry xml:id="faq.mailinglist.isthere">
    <question>
     <para>&iquest;Existen listas de correo sobre PHP?</para>
    </question>
    <answer>
     <para>
      &iexcl;Por supuesto! Existen varias listas de correo para varios
      asuntos. Una lista completa de listas de correo puede
      encontrarse en nuestra p&aacute;gina de <link
      xlink:href="&url.php.support;">Soporte</link>.
     </para>
     <para>
      La lista de correo m&aacute;s general
      es <literal>php-general</literal>. Para suscribirse,
      env&iacute;e un correo a
      <link
      url="mailto:&url.ml.general.subscribe;">&url.ml.general.subscribe;</link>. No
      necesita incluir nada especial en el asunto o cuerpo del
      mensaje. Para cancelar la suscripci&oacute;n, env&iacute;e un
      correo a <link
      url="mailto:&url.ml.general.unsubscribe;">&url.ml.general.unsubscribe;</link>.
     </para>
     <para>
      Tambi&eacute;n puede iniciar y cancelar suscripciones usando la
      interfaz web en nuestra p&aacute;gina de <link
      xlink:href="&url.php.support;">Soporte</link>.
     </para>
    </answer>
   </qandaentry>

   <qandaentry xml:id="faq.mailinglist.others">
    <question>
     <para>&iquest;Existen otras comunidades?</para>
    </question>
    <answer>
     <para>
      Existe un sinn&uacute;mero de ellas alrededor del
      mundo. Nosotros contamos con enlaces, por ejemplo, hacia
      servidores IRC y listas de correo en diferentes lenguajes en
      nuestra p&aacute;gina de <link
      xlink:href="&url.php.support;">Soporte</link>.
     </para>
    </answer>
   </qandaentry>

   <qandaentry xml:id="faq.mailinglist.subscribing">
    <question>
     <para>
      &iexcl;Ayuda! &iexcl;Aparentemente no puedo iniciar/cancelar
      suscripciones en una de las listas de correo!
     </para>
    </question>
    <answer>
     <para>
      Si tiene problemas con la suscripci&oacute;n o
      cancelaci&oacute;n de una suscripci&oacute;n en la lista de
      correo php-general, puede ser debido a que el software de la
      lista de correo no puede adivinar la direcci&oacute;n de correo
      apropiada para usar. Si su direcci&oacute;n de correo
      electr&oacute;nico era <literal>joeblow@example.com</literal>,
      puede enviar su petici&oacute;n de suscripci&oacute;n
      a <literal>php-general-subscribe-joeblow=example.com@lists.php.net</literal>,
      o su petici&oacute;n de cancelaci&oacute;n del servicio
      a <literal>php-general-unsubscribe-joeblow=example.com@lists.php.net</literal>. Use
      direcciones similares para las otras listas de correo.
     </para>
    </answer>
   </qandaentry>

   <qandaentry xml:id="faq.mailinglist.archive">
    <question>
     <para>&iquest;Existe un archivo de las listas de correo en alguna
     parte?</para>
    </question>
    <answer>
     <para>
      Si, encontrar&aacute; una lista de sitios que mantienen archivos
      en la p&aacute;gina de <link
      xlink:href="&url.php.support;">Soporte</link>.  Los art&iacute;culos
      de las listas de correo tambi&eacute;n son archivados como
      mensajes de noticias. Puede acceder al servidor de noticias
      en <link xlink:href="&url.php.news;">&url.php.news;</link> con un
      cliente de este servicio. Tambi&eacute;n existe una interfaz web
      experimental para el servidor de noticias en <link
      xlink:href="&url.php.newsweb;">&url.php.newsweb;</link>
     </para>
    </answer>
   </qandaentry>

   <qandaentry xml:id="faq.mailinglist.question">
    <question>
     <para>&iquest;Qu&eacute; puedo preguntar a la lista de
     correo?</para>
    </question>
    <answer>
     <para>
      Dado que PHP est&aacute; creciendo m&aacute;s y m&aacute;s cada
      d&iacute;a, el tr&aacute;fico en la lista de correo php-general
      se ha incrementado y en el momento ronda los 150 a 200 mensajes
      por d&iacute;a. Debido a esto, es del inter&eacute;s de todos
      que use la lista como un &uacute;ltimo recurso una vez ha
      probado todos los otros caminos.
     </para>
     <para>
      Antes de enviar un mensaje a la lista, por favor eche un vistazo
      a este FAQ y el manual para ver si puede encontrar ayuda en
      tales sitios. Si no encuentra nada, pruebe con los archivos de
      la lista de correo (vea la menci&oacute;n de este tema en un
      punto anterior). Si tiene problemas con la instalaci&oacute;n o
      configuraci&oacute;n de PHP, por favor lea en su totalidad la
      documentaci&oacute;n incluida y los documentos README. Si aun no
      puede encontrar informaci&oacute;n que le ayude, entonces es
      m&aacute;s que bienvenido a usar la lista de correo.
     </para>
     <para>
      Antes de formular preguntas, puede que quiera leer el documento sobre
      <link xlink:href="&url.smart.questions;">C&oacute;mo Formular
      Preguntas de Forma Inteligente</link>, cosa que es una buena
      idea para todos.
     </para>
    </answer>
   </qandaentry>
   
   <qandaentry xml:id="faq.mailinglist.guideline">
    <question>
     <para>&iquest;Qu&eacute; informaci&oacute;n debo incluir cuando
     env&iacute;o mensajes a la lista de correo?</para>
    </question>
    <answer>
     <para>
      Mensajes del tipo "&iexcl;No logro que PHP funcione!
      &iexcl;Ay&uacute;denme! &iquest;Qu&eacute; est&aacute; pasando?"
      son absolutamente in&uacute;tiles para cualquier persona. Si
      est&aacute; sufriendo dificultades con la configuraci&oacute;n y
      ejecuci&oacute;n de PHP, debe incluir informaci&oacute;n sobre
      el sistema operativo que usa, la versi&oacute;n de PHP que
      est&aacute; tratando de instalar, en qu&eacute; forma
      adquiri&oacute; el software (pre-compilado, CVS, RPMs, etc),
      qu&eacute; ha hecho hasta el momento, en qu&eacute; punto se
      interrumpi&oacute; el proceso, y el mensaje de error exacto.
     </para>
     <para>
      Esto se aplica tambi&eacute;n para cualquier otro problema. Debe
      incluir informaci&oacute;n sobre lo que ha hecho, en
      d&oacute;nde qued&oacute; bloqueado, qu&eacute; est&aacute;
      tratando de hacer y, si se aplica, los mensajes de error
      exactos. Si tiene problemas con su c&oacute;digo fuente,
      necesita incluir la parte de &eacute;ste que no est&aacute;
      trabajando. &iexcl;Aunque, no incluya m&aacute;s c&oacute;digo
      del necesario! Hace que el mensaje sea dif&iacute;cil de leer, y
      muchas personas pueden simplemente ignorarlo por esta
      raz&oacute;n. Si no est&aacute; seguro sobre la cantidad de
      informaci&oacute;n a incluir en el correo, es mejor que incluya
      de m&aacute;s.
     </para>
     <para>
      Otra cosa importante a tener en cuenta es ofrecer un resumen de
      su problema en la l&iacute;nea de asunto. Un asunto como
      "&iexcl;AY&Uacute;DENME!!!"  o "&iquest;Cu&aacute;l es el
      problema aqu&iacute;?" ser&aacute; ignorado por la
      mayor&iacute;a de lectores.
     </para>
     <para>
      Y, por &uacute;ltimo, es recomendable que lea el documento sobre
      <link xlink:href="&url.smart.questions;">C&oacute;mo Formular
      Preguntas de Forma Inteligente</link>, cosa que ser&aacute; de
      ayuda para todos, especialmente para usted.
     </para>
    </answer>
   </qandaentry>
  </qandaset>
 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
