<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.2 $ -->
<!-- EN-Revision: 1.6 Maintainer: lboshell Status: ready -->
 <chapter xml:id="chm.about" xmlns="http://docbook.org/ns/docbook" xmlns:xlink="http://www.w3.org/1999/xlink">
  <title>Sobre Esta Edici&oacute;n</title>

  <para>
   La Edici&oacute;n de Ayuda HTML Windows del Manual de PHP
   est&aacute; dirigida a desarrolladores, quienes desean tener el
   manual a mano todo el tiempo, y desean leer p&aacute;ginas del
   manual y notas de usuarios sin tener que esperar a que descargue
   una p&aacute;gina web remota. Esta edici&oacute;n le ofrece el
   contenido completo del manual m&aacute;s las anotaciones de
   usuarios, con algunas excelentes caracter&iacute;sticas adicionales
   ofrecidas por la aplicaci&oacute;n visora, por los scripts que
   usamos para generar &eacute;ste formato y por otros contribuyentes
   en forma de skins.
  </para>
  
  <para>
   Esta distribuci&oacute;n del Manual de PHP contiene varios
   archivos, incluyendo el archivo principal del
   manual, <filename>php_manual_en.chm</filename>. Puede ver el manual
   haciendo doble clic sobre &eacute;ste archivo (tal y como ya lo
   habr&aacute; adivinado). Las notas de usuario se encuentran
   en <filename>php_manual_notes.chm</filename>. Solo necesita tener
   una copia de &eacute;ste archivo en su equipo, independientemente
   de cu&aacute;ntos lenguajes usa para leer el Manual de PHP. El
   &uacute;nico requerimiento es que necesita tener todos los
   archivos <filename>php_manual_LANG.chm</filename> en un directorio
   junto con <filename>php_manual_notes.chm</filename>. Tambi&eacute;n
   puede ver un archivo <filename>php_manual_en.chw</filename> en el
   directorio, &eacute;ste es generado la primera vez que usa la
   pesta&ntilde;a del &iacute;ndice, y contiene un &iacute;ndice con
   las p&aacute;ginas del manual.
  </para>
  
  <para>
   Para aquellos interesados en los detalles t&eacute;cnicos del
   formato Microsoft HTML Help, <link
   xlink:href="&url.chm.helpware;">&url.chm.helpware;</link> constituye un
   excelente recurso. Para m&aacute;s informaci&oacute;n, y saber del
   lugar de Windows HTML Help entre los formatos de ayuda de Microsoft
   y su historia de servicios, consulte este <link
   xlink:href="&url.chm.history;">art&iacute;culo de WinWriters</link>.
  </para>
   
 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
