<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision$ -->
<!-- EN-Revision: n/a Maintainer: lboshell Status: ready -->
 <chapter xml:id="chm.specialities" xmlns="http://docbook.org/ns/docbook" xmlns:xlink="http://www.w3.org/1999/xlink">
  <title>Particularidades de esta Edici&oacute;n</title>

  <para>
   La Edici&oacute;n de Ayuda HTML de Windows del Manual de PHP
   sobrepasa las capacidades de presentaci&oacute;n e interactividad
   ofrecidas por otras ediciones (incluyendo el manual en
   l&iacute;nea). Esto fue posible ya que, en la actualidad, los
   archivos CHM solo pueden ser vistos en Windows usando Internet
   explorer, as&iacute; que podemos desarrollar para una familia de
   navegadores y un sistema operativo. Visores para otros sistemas
   operativos pueden ser desarrollados en el futuro por terceros.
  </para>
  
  <sect1 xml:id="chm.specialities.prefs">
   <title>Preferencias de Usuario</title>

   <para>
    La mayor&iacute;a de caracter&iacute;sticas interactivas de este
    manual son ofrecidas por la aplicaci&oacute;n visora (incluyendo
    b&uacute;squedas de texto completo, &iacute;ndice, lista de
    favoritos), pero hemos extendido esta lista con herramientas
    espec&iacute;ficas del Manual de PHP. Todas estas pueden ajustarse
    a sus necesidades usando una simple aplicaci&oacute;n de
    escritorio llamada <filename>php_manual_prefs.exe</filename>. Si
    ejecuta este programa, puede ver tres grupos de preferencias:
    Funciones en L&iacute;nea, Men&uacute; de Contexto, y Skin. Todas
    sus preferencias son almacenadas
    en <filename>php_manual_prefs.js</filename>.
   </para>
   
   <para>
    Las funciones en l&iacute;nea le permiten tener elementos
    conectados a sitios web. Las dos que puede apreciar en todas las
    p&aacute;ginas del manual son "Esta p&aacute;gina en l&iacute;nea"
    y "Reporte un fallo". Como puede suponer, la primera le muestra la
    misma p&aacute;gina en el manual en l&iacute;nea, la segunda abre
    una p&aacute;gina desde <link
    xlink:href="&url.php.bugs;">&url.php.bugs;</link> y llena previamente
    algunos datos por usted. Necesita elegir un sitio mirror para usar
    las funciones en l&iacute;nea "sensibles a php.net". Se recomienda
    el uso de un sitio mirror cercano para obtener la mayor
    rapidez. Otros componentes que pueden ser afectados por este
    par&aacute;metro de funciones en l&iacute;nea incluyen los items
    del men&uacute; de contexto que abren nuevos sitios web (por
    ejemplo, "Buscar Selecci&oacute;n en Google"). Los
    dise&ntilde;os personalizados pueden incluir tambi&eacute;n
    elementos restringidos por este par&aacute;metro.
   </para>
   
   <para>
    Los par&aacute;metros del men&uacute; de contexto le permiten
    elegir el men&uacute; de contexto que prefiere. Esta
    aplicaci&oacute;n le ofrece una opci&oacute;n para definir su
    propio men&uacute; de contexto, a&ntilde;adiendo elementos a
    &eacute;ste desde un conjunto predefinido. Puede asociar este
    men&uacute; de contexto personalizado con el clic derecho de su
    mouse, y tener el men&uacute; original asociado con CTRL+clic
    derecho, o viceversa. Existen tres tipos especiales de items de
    men&uacute; de contexto personalizados:
    <table>
     <title>Items de men&uacute; de contexto</title>
     <tgroup cols="3">
      <thead>
       <row>
        <entry>Tipo</entry>
        <entry>Ejemplos</entry>
        <entry>Comentarios</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Salto de P&aacute;gina</entry>
        <entry>Referencia de Funciones, &Iacute;ndice de
        Funciones</entry>
        <entry>
         &Eacute;stos items saltan a una p&aacute;gina
         espec&iacute;fica en el documento CHM. Sin embargo, las
         opciones de Salto de P&aacute;gina no se encuentran
         restringidas a un punto al interior del mismo
         documento. Pueden apuntar a sitios web u otros recursos. Las
         opciones de salto de p&aacute;gina con un segmento de
         protocolo en la URL abren una nueva ventana.
        </entry>
       </row>
       <row>
        <entry>Llamada de Funci&oacute;n</entry>
        <entry>Imprimir p&aacute;gina, Seleccionar todo, Copiar
        selecci&oacute;n al portapapeles, Buscar Selecci&oacute;n en
        Google</entry>
        <entry>
         Estas son "llamadas de funci&oacute;n" para funciones del
         men&uacute; de contexto definidas internamente. Los dos
         &uacute;ltimos ejemplos tienen la peculiaridad de que
         s&oacute;lo se muestran en el men&uacute; si se aplica el
         clic derecho en una selecci&oacute;n. Actualmente no hay
         forma de extender el men&uacute; de contexto con las
         funciones de skin definidas.
        </entry>
       </row>
       <row>
        <entry>Visualizaci&oacute;n especial</entry>
        <entry>Caja de B&uacute;squeda Google, Caja de B&uacute;squeda
        AlltheWeb</entry>
        <entry>
         Estos son desplegados como formularios HTML, en donde puede
         buscar por palabras claves, presionar ENTER, y recibir una
         ventana nueva con la b&uacute;squeda efectuada en el motor de
         b&uacute;squeda apropiado. En la actualidad no hay forma de
         extender el conjunto de items de men&uacute; de contexto
         desplegados de forma especial.
        </entry>
       </row>
      </tbody>
     </tgroup>
    </table>
    Los posibles elementos del men&uacute; de contexto y sus
    "implementaciones abstractas" son almacenadas
    en <filename>context.ini</filename>. Usted dispone de la habilidad
    de a&ntilde;adir posibles opciones de salto de p&aacute;gina
    all&iacute;, pero en la actualidad no hay forma de extender el
    sistema de men&uacute; de contexto con funciones definidas por el
    usuario (skin). Los posibles sitios mirror est&aacute;n listados
    en <filename>mirrors.ini</filename>. Si&eacute;ntase libre de
    sugerirnos nuevos items del men&uacute; de contexto en 
    <link xlink:href="mailto:&email.php.doc.chm;">&email.php.doc.chm;</link>.
   </para>
   
   <para>
    El par&aacute;metro sobre skins le permite elegir entre los dos
    skins integrados por defecto, o cualquier skin definido por el
    usuario. El skin Low es optimizado para su visualizaci&oacute;n
    correcta en cualquier tama&ntilde;o peque&ntilde;o, el skin High
    est&aacute; optimizado para su comodidad visual. Otros skins
    pueden ser desarrollados de acuerdo a nuestra <link
    linkend="chm.skins">gu&iacute;a de desarrollo de skins</link>. El
    lugar recomendado para skins en el sistema de archivos es la
    sub-carpeta <filename>skins/SKINNAME</filename> del directorio del
    Manual de PHP. Aunque no se requiere, algunos skins pueden definir
    otras reglas (cosa no recomendable). Hemos incluido skins de
    muestra para que vea ejemplos de c&oacute;mo desarrollar skins
    para el Manual de PHP.
   </para>
   
   <para>
    Cuenta con tres botones para elegir al final. El bot&oacute;n
    Aplicar aplica sus cambios sin salir, el bot&oacute;n OK aplica y
    cierra la aplicaci&oacute;n, el bot&oacute;n Cancelar no modifica
    sus par&aacute;metros y cierra el programa.
   </para>
  </sect1>
  
  <sect1 xml:id="chm.specialities.presentation">
   <title>Particularidades de Presentaci&oacute;n</title>
   
   <para>
    Esta edici&oacute;n del Manual de PHP est&aacute; altamente
    optimizada para su presentaci&oacute;n en pantalla. Los skins
    pueden ser desarrollados para un mejor soporte de
    impresi&oacute;n, ya que &eacute;ste no era el prop&oacute;sito de
    los skins incluidos. Este enfoque nos permite hacer varias
    modificaciones a la presencaci&oacute;n de diferentes partes del
    manual.
   </para>
   
   <para>
    Lo primero que notar&aacute; es que todos los ejemplos poseen el
    c&oacute;digo resaltado, usando la
    funci&oacute;n <function>show_source</function>. Los colores
    usados en la pr&aacute;ctia son definidos por clases CSS. Los
    ejemplos tambi&eacute;n incluyen enlaces a las funciones usadas en
    ellos para ofrecer acceso r&aacute;pido al material de
    referencia. Todos los ejemplos de c&oacute;digo tienen un enlace
    "copiar al portapapeles" al lado de ellos, con el cual puede
    copiar los contenidos del texto del ejemplo en el portapapeles.
   </para>
   
   <para>
    Los enlaces externos son marcados con un signo &raquo; especial, y
    se abren en una nueva ventana del navegador. Tambi&eacute;n
    incluimos la informaci&oacute;n "ruta hacia esta p&aacute;gina" en
    todas las p&aacute;ginas, para que puede identificar
    f&aacute;cilmente en d&oacute;nde se encuentra y navegar como lo
    requiera.
   </para>
   
   <para>
    Otras partes del manual son bastante similares a aquellas de la
    edici&oacute;n en l&iacute;nea por defecto, aunque skins
    personalizados pueden modificar muchos elementos en las
    p&aacute;ginas.
   </para>
  </sect1>
   
 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
