<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.2 $ -->
<!-- EN-Revision: 1.5 Maintainer: lboshell Status: ready -->
 <chapter xml:id="chm.using" xmlns="http://docbook.org/ns/docbook">
  <title>Uso de la Edici&oacute;n CHM del Manual de PHP</title>

  <para>
   Cuando realiza doble-clic sobre un archivo CHM, una ventana del
   Visor de Ayuda HTML es abierta con tres p&aacute;neles. En el lado
   izquierdo de la ventana se encuentra el panel de
   Navegaci&oacute;n. &Eacute;ste contiene cuatro solapas de
   navegaci&oacute;n: las solapas de Contenido, &Iacute;ndice,
   B&uacute;squeda y Favoritos. En el lado derecho de la ventana se
   encuentra el panel de T&oacute;pico. &Eactue;ste despliega el tema
   de ayuda seleccionado, o el tema de ayuda predeterminado en el
   arranque. Las p&aacute;ginas de ayuda son todas archivos HTML
   separados, su instalaci&oacute;n de Internet Explorer despliega las
   p&aacute;ginas en el panel de T&oacute;pico. El tercer panel es la
   barra de herramientas, la cual est&aacute; ubicada por debajo de la
   barra de t&iacute;tulo de la ventana de ayuda. Puede ajustar la
   apariencia horizontal al arrastrar el borde vertical entre el panel
   de Navegaci&oacute;n y el panel de T&oacute;pico.
  </para>
  
  <para>
   Note que cuando abre el documento CHM por primera vez, puede
   aparecer con una posici&oacute;n y tama&ntilde;o
   extra&ntilde;os. Desde entonces, windows recuerda la
   posici&oacute;n de la ventana, su tama&ntilde;o y la solapa abierta
   por &uacute;ltima vez. Toda esta informaci&oacute;n, incluyendo sus
   favoritos, es almacenada en un archivo
   llamado <filename>hh.dat</filename>. Si mueve su archivo a otro
   directorio, todas estas preferencias recordadas se perder&aacute;n
   (&iexcl;incluyendo su lista de favoritos!). Aunque, si reemplaza su
   archivo CHM por uno nuevo, con el mismo nombre, no ser&aacute; un
   problema. Los nombres de archivo y valores de ruta son almacenados
   en <filename>hh.dat</filename>.
  </para>
  
  <sect1 xml:id="chm.using.toolbar">
   <title>La Barra de Herramientas de la Ayuda HTML</title>
   <para>
    La Barra de Herramientas de la Ayuda HTML contiene los siguientes
    &iacute;conos, cuando se encuentra consultando el Manual de PHP:
    <itemizedlist>
     <listitem>
      <simpara>Esconder/Mostrar - Esconde/muestra el panel de
      navegaci&oacute;n.</simpara>
     </listitem>
     <listitem>
      <simpara>
       Ubicar - Ubica un t&oacute;pico en la solapa de contenidos (en
       caso de que haya encontrado un t&oacute;pico a trav&eacute;s de
       la b&uacute;squeda, el &iacute;ndice o los favoritos, y
       quisiera ver en d&oacute;nde se encuentra en la vista de
       &aacute;rbol de la tabla de contenidos).
       </simpara>
     </listitem>
     <listitem>
      <simpara>Atr&aacute;s - Va hacia atr&aacute;s en el
      historial.</simpara>
     </listitem>
     <listitem>
      <simpara>Adelante - Va hacia adelante en el historial.</simpara>
     </listitem>
     <listitem>
      <simpara>Refrescar - Recarga la p&aacute;gina actual.</simpara>
     </listitem>
     <listitem>
      <simpara>Inicio - Abre la p&aacute;gina de inicio del documento
      CHM.</simpara>
     </listitem>
     <listitem>
      <simpara>Imprimir - Abre el cuadro de di&aacute;logo de
      impresi&oacute;n.</simpara>
     </listitem>
     <listitem>
      <simpara>Opciones - Provee una lista con m&aacute;s
      opciones.</simpara>
     </listitem>
    </itemizedlist>
    El uso de esta barra de herramientas es realmente sencillo, muchos
    de los &iacute;conos de la barra de herramientas est&aacute;n
    relacionados fuertemente con sus equivalentes en Internet
    Explorer.
   </para>
  </sect1>
  
  <sect1 xml:id="chm.using.navpane">
   <title>El Panel de Navegaci&oacute;n</title>
   <para>
    El Panel de Navegaci&oacute;n contiene cuatro solapas de
    navegaci&oacute;n: las solapas de Contenido, &Iacute;ndice,
    B&uacute;squeda y Favoritos. &Eacute;stas proveen m&eacute;todos
    diferentes para acceder a un t&oacute;pico en el archivo de ayuda.
    <itemizedlist>
     <listitem>
      <simpara>
       La solapa de contenidos revela una tabla de contenidos en forma
       de &aacute;rbol, en donde puede navegar al t&oacute;pico
       deseado al abrir y cerrar partes del &aacute;rbol. Puede
       incluso acceder a las secciones m&aacute;s profundas usando
       &eacute;sta tabla de contenidos. Si hace clic derecho sobre un
       item aqu&iacute; y selecciona "Imprimir...", tendr&aacute; la
       opci&oacute;n de imprimir el t&oacute;pico seleccionado o el
       t&oacute;pico seleccionado junto con todos los sub-temas. Sin
       embargo, la impresi&oacute;n no es el objetivo inicial de esta
       versi&oacute;n del manual (la versi&oacute;n PDF es apropiada
       para su impresi&oacute;n).
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       La solapa de &iacute;ndice lista un gran n&uacute;mero de
       "palabras clave" (en realidad, t&iacute;tulos de p&aacute;ginas
       del manual). Puede seleccionar una, o comenzar a escribir una
       palabra clave, ver la lista ajustarse a su entrada, y luego
       hacer clic sobre un tema, o presionar enter si el tema
       seleccionado es el que desea consultar.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       La solapa de b&uacute;squeda muestra una de las
       caracter&iacute;sticas m&aacute;s poderosas del Visor de Ayuda
       HTML, la b&uacute;squeda de texto completo (tambi&eacute;n
       conocida como FTS, por sus siglas en
       Ingl&eacute;s). Aqu&iacute; puede escribir su expresi&oacute;n
       de b&uacute;squeda, conectando palabras opcionalmente con
       AND/OR/NEAR/NOT. Antes de que haga clic sobre 'Listar temas',
       tambi&eacute;n puede definir algunas opciones en la parte
       baja. Luego de que los resultados de b&uacute;squeda son
       desplegados, notar&aacute; que el texto del manual y los
       resultados de notas de usuario son separados. Para ordenar
       ambos tipos, pulse sobre la cabecera de la columna
       'Ubicaci&oacute;n'. Ahora, desde la lista de resultados de la
       b&uacute;squeda, puede seleccionar un tema, y ver su
       p&aacute;gina. Las palabras que ha buscado son resaltadas en la
       p&aacute;gina.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       La solapa de favoritos le permite guardar una lista con los
       temas m&aacute;s usados, para su f&aacute;cil
       acceso. Aqu&iacute; puede ver la lista, agregar un tema a ella,
       eliminar un tema, o desplegar un item
       seleccionado. Tambi&eacute;n puede especificar su propio
       t&iacute;tulo para el favorito, escribi&eacute;ndolo en el
       cuadro 'Tema actual:'. Los t&iacute;tulos de p&aacute;ginas de
       notas de usuario son precedidos de la cadena 'N:', de modo que
       pueda distinguirlas de las p&aacute;ginas normales del manual
       en el listado de favoritos.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
  </sect1>
   
  <sect1 xml:id="chm.using.keyshorts">
   <title>Combinaciones de Teclado</title>
   <para>
    Hay varias combinaciones de teclas que puede usar para incrementar
    su productividad. Muchos usuarios encuentran m&aacute;s
    c&oacute;modo usar &eacute;stas combinaciones de teclado para
    acceder a los temas, en lugar de hacer uso de clics.
   </para>
   <para>
    <table>
     <title>Combinaciones de Teclado Generales del Visor de
     Ayuda</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Cerrar el Visor de Ayuda</entry>
        <entry>ALT+F4</entry>
       </row>
       <row>
        <entry>Mostrar el men&uacute; de Opciones </entry>
        <entry>ALT+O</entry>
       </row>
       <row>
        <entry>Esconder o mostrar el panel de
        Navegaci&oacute;n</entry>
        <entry>ALT+O, y luego T</entry>
       </row>
       <row>
        <entry>Imprimir un tema</entry>
        <entry>ALT+O, y luego P</entry>
       </row>
       <row>
        <entry>Moverse al tema anterior</entry>
        <entry>ALT+FLECHA IZQUIERDA</entry>
       </row>
       <row>
        <entry>Moverse al tema siguiente (provisto que lo ha visitado
        anteriormente)</entry>
        <entry>ALT+FLECHA DERECHA</entry>
       </row>
       <row>
        <entry>Activar o desactivar el resaltado de
        b&uacute;squedas.</entry>
        <entry>ALT+O, y luego O</entry>
       </row>
       <row>
        <entry>Regresar al inicio del archivo de ayuda</entry>
        <entry>ALT+O, y luego H</entry>
       </row>
       <row>
        <entry>Cambiar entre el panel de Navegaci&oacute;n y el panel
        de T&oacute;pico</entry>
        <entry>F6</entry>
       </row>
       <row>
        <entry>Desplazarse a trav&eacute;s de todos los enlaces en un
        tema o a trav&eacute;s de todas las opciones en una solapa del
        panel de Navegaci&oacute;n</entry>
        <entry>TAB</entry>
       </row>
       <row>
        <entry>Mostrar el men&uacute; de contexto (clic derecho) [vea
        la <link linkend="chm.specialities.prefs">secci&oacute;n de
        Preferencias de Usuario</link>]</entry>
        <entry>SHIFT+F10</entry>
       </row>
      </tbody>
     </tgroup>
    </table>

    <table>
     <title>Combinaciones de Teclado de la Solapa de
     Contenidos</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Mostrar la solapa de Contenidos</entry>
        <entry>ALT+C</entry>
       </row>
       <row>
        <entry>Abrir y cerrar un libro o carpeta</entry>
        <entry>SIGNO M&Aacute;S y SIGNO MENOS, o FLECHA IZQUIERDA y
        FLECHA DERECHA</entry>
       </row>
       <row>
        <entry>Seleccionar un tema</entry>
        <entry>FLECHA HACIA ABAJO y FLECHA HACIA ARRIBA</entry>
       </row>
       <row>
        <entry>Mostrar el tema seleccionado</entry>
        <entry>ENTER</entry>
       </row>
      </tbody>
     </tgroup>
    </table>

    <table>
     <title>Combinaciones de Teclado de la Solapa de
     &Iacute;ndice</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Mostrar la solapa de &Iacute;ndice</entry>
        <entry>ALT+N</entry>
       </row>
       <row>
        <entry>Escribir una palabra clave a buscar</entry>
        <entry>ALT+W, y luego escriba la palabra</entry>
       </row>
       <row>
        <entry>Seleccionar una palabra clave en la lista</entry>
        <entry>FLECHA HACIA ABAJO y FLECHA HACIA ARRIBA</entry>
       </row>
       <row>
        <entry>Mostrar el tema asociado</entry>
        <entry>ENTER o ALT+D</entry>
       </row>
      </tbody>
     </tgroup>
    </table>

    <table>
     <title>Combinaciones de Teclado de la Solapa de
     B&uacute;squeda</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Mostrar la solapa de B&uacute;squeda</entry>
        <entry>ALT+S</entry>
       </row>
       <row>
        <entry>Escribir una palabra clave a buscar</entry>
        <entry>ALT+W, y luego escriba la palabra</entry>
       </row>
       <row>
        <entry>Iniciar una b&uacute;squeda</entry>
        <entry>ALT+L</entry>
       </row>
       <row>
        <entry>Seleccioner un tema en la lista de resultados</entry>
        <entry>ALT+T, y luego FLECHA HACIA ABAJO y FLECHA HACIA
        ARRIBA</entry>
       </row>
       <row>
        <entry>Mostrar el tema seleccionado</entry>
        <entry>ENTER o ALT+D</entry>
       </row>
       <row>
        <entry>Buscar por una palabra clave en la lista de resultados
        de una b&uacute;squeda previa</entry>
        <entry>ALT+U</entry>
       </row>
       <row>
        <entry>Buscar por palabras similares a la palabra clave. Por
        ejemplo para encontrar palabras como "corriendo" y "corre"
        para la palabra clave "correr"</entry>
        <entry>ALT+M</entry>
       </row>
       <row>
        <entry>Buscar s&oacute;lo a trav&eacute;s de los
        t&iacute;tulos de los temas</entry>
        <entry>ALT+R</entry>
       </row>
      </tbody>
     </tgroup>
    </table>

    <table>
     <title>Combinaciones de Teclado de la Solapa de Favoritos</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Mostrar la solapa de Favoritos</entry>
        <entry>ALT+I</entry>
       </row>
       <row>
        <entry>Agregar el tema mostrado actualmente a la lista de
        Favoritos</entry>
        <entry>ALT+A</entry>
       </row>
       <row>
        <entry>Seleccionar un tema en la lista de Favoritos</entry>
        <entry>ALT+P, y luego FLECHA HACIA ABAJO y FLECHA HACIA
        ARRIBA</entry>
       </row>
       <row>
        <entry>Mostrar el tema seleccionado</entry>
        <entry>ENTER o ALT+D</entry>
       </row>
       <row>
        <entry>Eliminar el tema seleccionado de la lista</entry>
        <entry>ALT+R</entry>
       </row>
      </tbody>
     </tgroup>
    </table>

    <table>
     <title>Combinaciones de Teclado del Panel de
     T&oacute;pico</title>
     <tgroup cols="2">
      <thead>
       <row>
        <entry>Para</entry>
        <entry>Presione</entry>
       </row>
      </thead>
      <tbody>
       <row>
        <entry>Consultar en el &iacute;ndice</entry>
        <entry>Seleccione las palabras que quiere consultar y presione
        F1</entry>
       </row>
       <row>
        <entry>Encontrar en la p&aacute;gina</entry>
        <entry>CTRL+F, y luego ajuste las opciones</entry>
       </row>
       <row>
        <entry>Refrescar la p&aacute;gina</entry>
        <entry>F5</entry>
       </row>
      </tbody>
     </tgroup>
    </table>
   </para>
  </sect1>

 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
