<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.7 $ -->
<!-- EN-Revision: 1.9 Maintainer: lboshell Status: ready -->
<reference id="ref.com"> 
  <title>Funciones COM y .Net (Windows)</title> 
  <titleabbrev>COM</titleabbrev> 
  <partintro> 
   <section id="com.intro">
    &reftitle.intro;
    <para>
     COM es un acr&oacute;nimo para Component Object Model (Modelo de
     Objetos por Componentes); es una capa orientada a objetos (asi
     como servicios asociados) que cubre la especificaci&oacute;n DCE
     RPC (un est&aacute;ndar abierto) y define una convenci&oacute;n
     com&uacute;n de llamado que permite que c&oacute;digo escrito en
     cualquier lenguaje pueda llamar e inter-operar con c&oacute;digo
     escrito en cualquier otro lenguaje (provisto que ambos lenguajes
     hagan uso de COM). No solo es posible escribir el c&oacute;digo
     en cualquier lenguaje, tambi&eacute;n es cierto que no necesita
     ser parte del mismo ejecutable; el c&oacute;digo puede ser
     cargado desde un recurso DLL, encontrarse en otro proceso
     corriendo en la misma m&aacute;quina, o, mediante DCOM (COM
     Distribuido), encontrarse en otro proceso en una m&aacute;quina
     remota, todo esto sin requerir que su c&oacute;digo sepa siquiera
     en d&oacute;nde reside el componente.
    </para> 
    <para>
     Existe un sub-conjunto de COM conocido como Automatizaci&oacute;n
     OLE que se compone de un grupo de interfaces OLE que permiten los
     enlaces flexibles con objetos COM, de modo que puedan ser
     susceptibles a introspecci&oacute;n y llamados en tiempo de
     ejecuci&oacute;n sin conocimientos en tiempo de
     compilaci&oacute;n sobre el modo de operaci&oacute;n del
     objeto. La extensi&oacute;n COM de PHP utiliza las interfaces de
     Automatizaci&oacute;n OLE para permitirle crear y llamar objetos
     compatibles desde sus scripts. T&eacute;cnicamente hablando,
     &eacute;sta deber&iacute;a ser llamada la "Extensi&oacute;n de
     Automatizaci&oacute;n OLE para PHP", ya que no todos los objetos
     COM son compatibles con OLE.
    </para>
    <para>
     Ahora bien, &iquest;porqu&eacute; querr&iacute;a o deber&iacute;a
     usar COM? COM es una de las formas principales de unir
     aplicaciones y componentes en la plataforma Windows; mediante el
     usa de COM usted puede iniciar Microsoft Word, llenar una
     plantilla de documento y guardar el resultado como un documento
     Word y enviarlo a un visitante de su sitio web. Tambi&eacute;n
     puede usar COM para realizar tareas administrativas para su red y
     para configurar su servidor web (IIS); tales son apenas los usos
     m&aacute;s comunes; usted puede hacer mucho m&aacute;s con COM.
    </para>
    <para>
     A partir de PHP 5, esta extensi&oacute;n (y su
     documentaci&oacute;n) fue re-escrita por completo y se ha
     eliminado gran parte del material confuso e
     in&uacute;til. Adicionalmente, se ofrece soporte para la
     creaci&oacute;n de instancias y ensambles .Net usando la capa de
     interoperabilidad COM ofrecida por Microsoft.
    </para>
    <para>
     Por favor lea <ulink url="&url.zend.comdotnet;">este
     art&iacute;culo</ulink> para una vista general de los cambios en
     &eacute;sta extensi&oacute;n en PHP 5.
    </para>
   </section>

   <section id="com.requirements">
    &reftitle.required;
    <para>
     Las funciones COM se encuentran disponibles &uacute;nicamente
     para la versi&oacute;n Windows de PHP.
    </para>
    <para>
     El soporte para .Net requiere PHP 5 y el entorno de desarrollo
     .Net.
    </para>
   </section>

   <section id="com.installation">
    &reftitle.install;
    &no.install;
    &windows.builtin;
    <para>
     Usted es responsable de la instalaci&oacute;n del soporte para
     los varios objetos COM que piensa usar (tales como MS Word);
     nosotros no incluimos todos &eacute;stos con PHP, ni podemos
     hacerlo.
    </para>
   </section>

   <section id="com.foreach">
    <title>For Each</title>

    <para>
     A partir de PHP 5, usted puede usar la sentencia <xref
     linkend="control-structures.foreach"/> de PHP para iterar sobre
     los contenidos de un IEnumVariant COM/OLE est&aacute;ndar. En
     t&eacute;rminos m&aacute;s simples, esto quiere decir que puede
     usar foreach en aquellas situaciones en donde podr&iacute;a haber
     usado <literal>For Each</literal> en c&oacute;digo VB/ASP.
    </para>

   <para>
    <example>
     <title>For Each en ASP</title>
     <programlisting role="asp">
<![CDATA[
<%
Set objetoDominio = GetObject("WinNT://Domain")
For Each obj in objetoDominio
  Response.Write obj.Name & "<br />"
Next
%>
]]>
     </programlisting>
    </example>
   </para>

   <para>
    <example>
     <title>while() ... Next() en PHP 4</title>
     <programlisting role="php">
<![CDATA[
<?php
$objetoDominio = new COM("WinNT://Domain");
while ($obj = $objetoDominio->Next()) {
   echo $obj->Name . "<br />";
} 
?>
]]>
     </programlisting>
    </example>
   </para>

   <para>
    <example>
     <title>foreach en PHP 5</title>
     <programlisting role="php">
<![CDATA[
<?php
$objetoDominio = new COM("WinNT://Domain");
foreach ($objetoDominio as $obj) {
   echo $obj->Name . "<br />";
}
?>
]]>
     </programlisting>
    </example>
   </para>
   </section>

   <section id="com.arrays">
    <title>Matrices y propiedades COM tipo-matriz</title>

    <para>
     Muchos objetos COM exponen sus propiedades como matrices, o
     usando un acceso estilo-matriz. En PHP 4, es posible usar la
     sintaxis de matrices de PHP para leer/escribir tales propiedades,
     pero s&oacute;lo es posible manipular una dimensi&oacute;n. Si
     desea leer una propiedad multi-dimensional, puede crear el acceso
     en forma de un llamado de funci&oacute;n, en donde cada
     par&aacute;metro representa cada par&aacute;metro del acceso a la
     matriz, aunque no hay forma de escribir tal tipo de propiedad.
    </para>

    <para>
     PHP 5 introduce las siguientes caracter&iacute;sticas nuevas para
     facilitar su vida:

     <itemizedlist>
      <listitem>
       <para>
        Acceso a matrices multi-dimensionales, o propiedades COM que
        requieren m&uacute;ltiples par&aacute;metros usando la
        sintaxis de matrices de PHP. Tambi&eacute;n puede escribir o
        definir propiedades usando &eacute;sta t&eacute;cnica.
       </para>
      </listitem>

      <listitem>
       <para>
        Iterar a trav&eacute;s de SafeArrays ("verdaderas" matrices)
        usando la estructura de control <xref
        linkend="control-structures.foreach"/>. Esto funciona ya que
        los SafeArrays incluyen informaci&oacute;n sobre su
        tama&ntilde;o. Si una propiedad estilo-matriz implementa
        IEnumVariant, entonces tambi&eacute;n puede usar foreach para
        tales propiedades; eche un vistazo a <xref
        linkend="com.foreach"/> para m&aacute;s informaci&oacute;n
        sobre este tema.
       </para>
      </listitem>
     </itemizedlist>
    </para>

   </section>

   <section id="com.exceptions">
    <title>Excepciones (PHP 5)</title>

    <para>
     Esta extensi&oacute;n arroja instancias de la clase
     <literal>com_exception</literal> siempre que se presente un error
     potencialmente fatal reportado por COM. Todas las excepciones COM
     tienen una propiedad <literal>code</literal> bien definida que
     corresponde con el valor de retorno HRESULT proveniente de las
     varias operaciones COM. Es posible usar &eacute;ste c&oacute;digo
     para tomar decisiones program&aacute;ticas sobre c&oacute;mo
     manejar la excepci&oacute;n.
    </para>

   </section>

   &reference.com.ini;

   &reference.com.constants;
   
   <section id="com.seealso">
    &reftitle.seealso;
    <para>
     Para m&aacute;s informaci&oacute;n sobre COM, lea la <ulink
     url="&url.comspecs;">especificaci&oacute;n COM</ulink> o
     quiz&aacute;s eche un vistazo a la <ulink url="&url.yacl;">Otra
     Librer&iacute;a COM M&aacute;s (YACL por sus siglas en
     Ingl&eacute;s)</ulink> de Don Box. Puede encontrar
     informaci&oacute;n adicional en nuestro FAQ sobre <xref
     linkend="faq.com"/>. Si est&aacute; pensando en usar aplicaciones
     MS Office en el lado del servidor, es buena idea que lea la
     informaci&oacute;n encontrada aqu&iacute;: <ulink
     url="&url.msoffice.serverside;">Consideraciones para la
     Automatizaci&oacute;n de Office en el Lado del Servidor</ulink>.
    </para>
   </section>
  </partintro> 

&reference.com.functions;

</reference>
<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
