<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision$ -->
<!-- EN-Revision: n/a Maintainer: rafael Status: ready -->

 <chapter xml:id="introduction" xmlns="http://docbook.org/ns/docbook" xmlns:xlink="http://www.w3.org/1999/xlink">
  <title>Introducci&oacute;n</title>

  <sect1 xml:id="intro-whatis">
   <title>&iquest;Qu&eacute; es PHP?</title>
   <simpara>
    PHP (acr&oacute;nimo de "PHP: Hypertext Preprocessor") es un
    lenguaje de "c&oacute;digo abierto" interpretado, de alto nivel,
    embebido en p&aacute;ginas HTML y ejecutado en el servidor.
   </simpara>
   <para>
    Una respuesta corta y concisa, pero, &iquest;qu&eacute; significa
    realmente? Un ejemplo nos aclarar&aacute; las cosas:
   </para>
   <para>
    <example>
     <title>Un ejemplo introductorio</title>
     <programlisting role="php">
<![CDATA[
<html>
    <head>
        <title>Ejemplo</title>
    </head>
    <body>

        <?php 
        echo "Hola, &iexcl;soy un script PHP!"; 
        ?>

    </body>
</html>
]]>
     </programlisting>
    </example>
   </para>
   <para>
    Puede apreciarse que no es lo mismo que un script escrito en otro
    lenguaje de programaci&oacute;n como Perl o C -- En vez de
    escribir un programa con muchos comandos para crear una salida en
    HTML, escribimos el c&oacute;digo HTML con cierto c&oacute;digo
    PHP embebido (incluido) en el mismo, que producir&aacute; cierta
    salida (en nuestro ejemplo, producir&aacute; un texto). El
    c&oacute;digo PHP se incluye entre <link
    linkend="language.basic-syntax.phpmode">etiquetas especiales de
    comienzo y final</link> que nos permitir&aacute;n entrar y salir
    del modo PHP.
   </para>
   <para>
    Lo que distingue a PHP de la tecnolog&iacute;a Javascript, la cual
    se ejecuta en la m&aacute;quina cliente, es que el c&oacute;digo
    PHP es ejecutado en el servidor. Si tuvi&eacute;semos un script
    similar al de nuestro ejemplo en nuestro servidor, el cliente
    solamente recibir&iacute;a el resultado de su ejecuci&oacute;n en
    el servidor, sin ninguna posibilidad de determinar qu&eacute;
    c&oacute;digo ha producido el resultado recibido. El servidor web
    puede ser incluso configurado para que procese todos los archivos
    HTML con PHP.
   </para>
   <para>
    Lo mejor de usar PHP es que es extremadamente simple para el
    principiante, pero a su vez, ofrece muchas caracter&iacute;sticas
    avanzadas para los programadores profesionales. No sienta miedo de
    leer la larga lista de caracter&iacute;sticas de PHP, en poco
    tiempo podr&aacute; empezar a escribir sus primeros scripts.
   </para>
   <para>
    Aunque el desarrollo de PHP est&aacute; concentrado en la
    programaci&oacute;n de scripts en el lado del servidor, se puede
    utilizar para muchas otras cosas. Siga leyendo y descubra
    m&aacute;s sobre PHP en la secci&oacute;n <link
    linkend="intro-whatcando">&iquest;Qu&eacute; se puede hacer con
    PHP?</link>.
   </para>
  </sect1>

  <sect1 xml:id="intro-whatcando">
   <title>&iquest;Qu&eacute; se puede hacer con PHP?</title>
   <para>
    PHP puede hacer cualquier cosa que se pueda hacer con un script
    CGI, como procesar la informaci&oacute;n de formularios, generar
    p&aacute;ginas con contenidos din&aacute;micos, o enviar y recibir
    cookies. Y esto no es todo, se puede hacer mucho m&aacute;s.
   </para>
   <para>
    Existen tres campos en los que se usan scripts escritos en PHP.
    <itemizedlist>
     <listitem>
      <simpara>
       Scripts del lado del servidor. Este es el campo m&aacute;s
       tradicional y el principal foco de trabajo. Se necesitan tres
       cosas para que esto funcione. El int&eacute;rprete PHP (CGI
       &oacute; m&oacute;dulo), un servidor web y un navegador. Es
       necesario correr el servidor web con PHP instalado. El
       resultado del programa PHP se puede obtener a trav&eacute;s del
       navegador, conect&aacute;ndose con el servidor web. Consultar
       la secci&oacute;n <link linkend="install"> Instrucciones
       de instalaci&oacute;n</link> para m&aacute;s
       informaci&oacute;n.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       Scripts en la l&iacute;nea de comandos. Puede crear un script
       PHP y correrlo sin ning&uacute;n servidor web o
       navegador. Solamente necesita el int&eacute;rprete PHP para
       usarlo de esta manera. Este tipo de uso es ideal para scripts
       ejecutados regularmente desde cron (en *nix o Linux) o el
       Planificador de tareas (en Windows). Estos scripts
       tambi&eacute;n pueden ser usados para tareas simples de
       procesamiento de texto. Consultar la secci&oacute;n <link
       linkend="features.commandline">Usos de PHP en la l&iacute;nea
       de comandos</link> para m&aacute;s informaci&oacute;n.
      </simpara>
     </listitem>
     <listitem>
      <simpara>
       Escribir aplicaciones de interfaz gr&aacute;fica. Probablemente
       PHP no sea el lenguaje m&aacute;s apropiado para escribir
       aplicaciones gr&aacute;ficas, pero si conoce bien PHP, y
       quisiera utilizar algunas caracter&iacute;sticas avanzadas en
       programas clientes, puede utilizar PHP-GTK para escribir dichos
       programas. Tambi&eacute;n es posible escribir aplicaciones
       independientes de una plataforma. PHP-GTK es una
       extensi&oacute;n de PHP, no disponible en la
       distribuci&oacute;n principal. Si est&aacute; interesado en
       PHP-GTK, puedes visitar las
       <link xlink:href="&url.php.gtk;">p&aacute;ginas web del
       proyecto</link>.
      </simpara>
     </listitem>
    </itemizedlist>
   </para>
   <para>
    PHP puede ser utilizado en cualquiera de los principales sistemas
    operativos del mercado, incluyendo Linux, muchas variantes Unix
    (incluyendo HP-UX, Solaris y OpenBSD), Microsoft Windows, Mac OS
    X, RISC OS y probablemente alguno m&aacute;s.  PHP soporta la
    mayor&iacute;a de servidores web de hoy en d&iacute;a, incluyendo
    Apache, Microsoft Internet Information Server, Personal Web
    Server, Netscape e iPlanet, Oreilly Website Pro server, Caudium,
    Xitami, OmniHTTPd y muchos otros. PHP tiene m&oacute;dulos
    disponibles para la mayor&iacute;a de los servidores, para
    aquellos otros que soporten el est&aacute;ndar CGI, PHP puede
    usarse como procesador CGI.
   </para>
   <para>
    De modo que, con PHP tiene la libertad de elegir el sistema
    operativo y el servidor de su gusto. Tambi&eacute;n tiene la
    posibilidad de usar programaci&oacute;n procedimental o
    programaci&oacute;n orientada a objetos. Aunque no todas las
    caracter&iacute;sticas est&aacute;ndar de la programaci&oacute;n
    orientada a objetos est&aacute;n implementadas en la
    versi&oacute;n actual de PHP, muchas bibliotecas y
    aplicaciones grandes (incluyendo la biblioteca PEAR)
    est&aacute;n escritas &iacute;ntegramente usando
    programaci&oacute;n orientada a objetos.
   </para>
   <para>
    Con PHP no se encuentra limitado a resultados en HTML. Entre las
    habilidades de PHP se incluyen: creaci&oacute;n de
    im&aacute;genes, archivos PDF y pel&iacute;culas Flash (usando
    libswf y Ming) sobre la marcha. Tambi&eacute; puede presentar
    otros resultados, como XHTM y archivos XML. PHP puede autogenerar
    &eacute;stos archivos y almacenarlos en el sistema de archivos en
    vez de presentarlos en la pantalla.
   </para>
   <para>
    Quiz&aacute;s la caracter&iacute;stica m&aacute;s potente y
    destacable de PHP es su soporte para una gran cantidad de bases de
    datos. Escribir un interfaz v&iacute;a web para una base de datos
    es una tarea simple con PHP. Las siguientes bases de datos
    est&aacute;n soportadas actualmente:
    <blockquote>
     <simplelist columns="3">
      <member>Adabas D</member>
      <member>dBase</member>
      <member>Empress</member>
      <member>FilePro (read-only)</member>
      <member>Hyperwave</member>
      <member>IBM DB2</member>
      <member>Informix</member>
      <member>Ingres</member>
      <member>InterBase</member>
      <member>FrontBase</member>
      <member>mSQL</member>
      <member>Direct MS-SQL</member>
      <member>MySQL</member>
      <member>ODBC</member>
      <member>Oracle (OCI7 and OCI8)</member>
      <member>Ovrimos</member>
      <member>PostgreSQL</member>
      <member>Solid</member>
      <member>Sybase</member>
      <member>Velocis</member>
      <member>Unix dbm</member>
     </simplelist>
    </blockquote>
     Tambi&eacute;n contamos con una extensi&oacute;n DBX de
     abstracci&oacute;n de base de datos que permite usar de forma
     transparente cualquier base de datos soportada por la
     extensi&oacute;n. Adicionalmente, PHP soporta ODBC (el
     Est&aacute;ndar Abierto de Conexi&oacute;n con Bases de Datos),
     asi que puede conectarse a cualquier base de datos que soporte
     tal est&aacute;ndar.
   </para>
   <para>
    PHP tambi&eacute;n cuenta con soporte para comunicarse con otros
    servicios usando protocolos tales como LDAP, IMAP, SNMP, NNTP,
    POP3, HTTP, COM (en Windows) y muchos otros. Tambi&eacute;n se
    pueden crear sockets puros. PHP soporta WDDX para el intercambio
    de datos entre lenguajes de programaci&oacute;n en web. Y hablando
    de interconexi&oacute;n, PHP puede utilizar objetos Java de forma
    transparente como objetos PHP Y la extensi&oacute;n de CORBA puede
    ser utilizada para acceder a objetos remotos.
   </para>
   <para>
    PHP tiene unas caracter&iacute;sticas muy &uacute;tiles para el
    procesamiento de texto, desde expresiones regulares POSIX
    extendidas o tipo Perl hasta procesadores de documentos XML. Para
    procesar y acceder a documentos XML, soportamos los
    est&aacute;ndares SAX y DOM. Puede utilizar la extensi&oacute;n
    XSLT para transformar documentos XML.
   </para>
   <para>
    Si usa PHP en el campo del comercio electr&oacute;nico,
    encontrar&aacute; muy &uacute;tiles las funciones Cybercash,
    CyberMUT, VeriSign Payflow Pro y CCVS para sus programas de pago.
   </para>
   <para>
    Para terminar, contamos con muchas otras extensiones muy
    interesantes, las funciones del motor de b&uacute;squedas
    mnoGoSearch, funciones para pasarelas de IRC, utilidades de
    compresi&oacute;n (gzip, bz2),, conversi&oacute;n de calendarios,
    traducci&oacute;n .....
   </para>
   <para>
    Como puede apreciar, esta p&aacute;gina no es suficiente para
    enumerar todas las caracter&iacute;sticas y beneficios que PHP
    ofrece. Consulte las secciones
    <link linkend="install">Instalaci&oacute;n de PHP</link> y 
    <link linkend="funcref">Referencia de las funciones</link> para
    una explicaci&oacute;n de las extensiones mencionadas aqu&iacute;.
   </para>
  </sect1>

 </chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->
