<?xml version="1.0" encoding="iso-8859-1"?>
 <reference id="ref.fdf">
  <title>Funciones Forms Data Format (Formato de Datos de Formularios)</title>
  <titleabbrev>FDF</titleabbrev>

  <partintro>

   <simpara>
    El Formato de Datos de Formulario (FDF) est&aacute; dise&ntilde;ado para el manejo
    de formularios en archivos PDF. Se aconseja leer la informaci&oacute;n disponible en <ulink url="http://partners.adobe.com/asn/developer/acrosdk/forms.html">http://partners.adobe.com/asn/developer/acrosdk/forms.html</ulink>
    para m&aacute;s informaci&oacute;n sobre lo que es FDF y c&oacute;mo se usa en general.</simpara>

   <note><simpara>
    Actualmente Adobe s&oacute;lo proporciona una versi&oacute;n compatible con libc5 para Linux.
    Las pruebas con glibc2 provocaron un fallo de segmentado. Si alguien es capaz
    de hacerla funcionar, por favor com&eacute;ntelo en esta p&aacute;gina.
   </simpara></note>

   <note><simpara>
    Si tiene problemas configurando php con soporte de fdftk, compruebe
    si el archivo de cabecera FdfTk.h y la librer&iacute;a libFdfTk.so est&aacute;n en
    su lugar correcto. Deber&iacute;an encontrarse respectivamente en fdftk-dir/include
    y en fdftk-dir/lib. Este problema no se dar&aacute; si se limita a desempaqueta
    la distribuc&oacute;n del FtdTk.
   </simpara></note>

   <simpara>
    La idea general del FDF es similar a los formularios HTML. La diferencia
    b&aacute;sicamente est&aacute; en el formato en que se transmiten los datos al servidor
    cuando se pulsa el bot&oacute;n de env&iacute;o (este es realmente 
    el Formato de Datos de Formulario) y el formato del formulario en s&iacute; mismo
    (que es el Formato de Documento Portable, PDF). Procesar lo datos del FDF
    es una de las caracter&iacute;sticas que proporcionan las funciones fdf. Pero a&uacute;n
    hay m&aacute;s. Uno tambi&eacute;n puede tomar un formulario PDF y rellenar los campos de
    entrada con datos sin modificar el formulario en s&iacute; mismo. En dicho caso, lo
    que se hace es crear un documento FDF (<function>fdf_create</function>), fijar
    los valores de cada campo de entrada (<function>fdf_set_value</function>) y 
    asociarlo con un formulario PDF (<function>fdf_set_file</function>). 
    Finalmente, debe ser enviado al navegador con el MimeType application/vnd.fdf.
    El plug-in de Acrobar reader de su navegador reconoce el MimeType, lee el formulario
    PDF asociado y rellena los datos a partir del documento FDF.
    </simpara>

   <simpara>
    Los siguientes ejemplos muestran c&oacute;mo se eval&uacute;an los datos de los formularios.</simpara>
   <simpara></simpara>
    <example>
     <title>Evaluando un documento FDF</title>
     <programlisting>
&lt;?php
// Guarda los datos FDF en un archivo temporal
$fdffp = fopen("test.fdf", "w");
fwrite($fdffp, $HTTP_FDF_DATA, strlen($HTTP_FDF_DATA));
fclose($fdffp);

// Abre archivo temporal y eval&uacute;a los datos
// El formulario pdf conten&iacute;a varios campos de texto con los nombres
// volumen, fecha, comentario, editorial, preparador, y dos casillas de verificaci&oacute;n
// muestra_editorial y muestra_preparador.
$fdf = fdf_open("test.fdf");
$volume = fdf_get_value($fdf, "volumen");
echo "El campo volumen tiene el valor '&lt;B>$volume&lt;/B>'&lt;BR>";

$date = fdf_get_value($fdf, "fecha");
echo "El campo fecha tiene el valor '&lt;B>$date&lt;/B>'&lt;BR>";

$comment = fdf_get_value($fdf, "comentario");
echo "El campo comentario tiene el valor '&lt;B>$comment&lt;/B>'&lt;BR>";

if(fdf_get_value($fdf, "muestra_editorial") == "On") {
  $publisher = fdf_get_value($fdf, "editorial");
  echo "El campo editorial tiene el valor '&lt;B>$publisher&lt;/B>'&lt;BR>";
} else
  echo "No se debe mostrar la editorial.&lt;BR>";

if(fdf_get_value($fdf, "muestra_preparador") == "On") {
  $preparer = fdf_get_value($fdf, "preparador");
  echo "El campo preparador tiene el valor '&lt;B>$preparer&lt;/B>'&lt;BR>";
} else
  echo "No se debe mostrar el preparador.&lt;BR>";
fdf_close($fdf);
?>
     </programlisting>
    </example>

  </partintro>

&reference.fdf.functions;

 </reference>
<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
-->

