<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.6 $ -->
<!-- EN-Revision: 1.20 Maintainer: javi Status: ready -->
<!-- splitted from ./es/functions/curl.xml, last change in rev 1.1 -->

  <refentry id="function.curl-setopt">
   <refnamediv>
    <refname>curl_setopt</refname>
    <refpurpose>Asigna un valor a una opci&oacute;n de una sesi&oacute;n CURL</refpurpose>
   </refnamediv>
   <refsect1>
    <title>Descripci&oacute;n</title>
     <methodsynopsis>
      <type>bool</type><methodname>curl_setopt</methodname>
      <methodparam><type>resource</type><parameter>ch</parameter></methodparam>
      <methodparam><type>int</type><parameter>option</parameter></methodparam>
      <methodparam><type>mixed</type><parameter>value</parameter></methodparam>
     </methodsynopsis>
    <para>
     La funci&oacute;n <function>curl_setopt</function> asigna valores para opciones
     de una sesi&oacute;n CURL identificada por el par&aacute;metro <parameter>ch</parameter>.
     El par&aacute;metro <parameter>option</parameter> especifica la opci&oacute;n a la que
     se desea asignar el valor indicado en el par&aacute;metro <parameter>value</parameter>.
    </para>
    <para>
	<parameter>value</parameter> debe ser una variable de tipo bool para los siguientes
     valores del par&aacute;metro <parameter>option</parameter>:
	<informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_AUTOREFERER</constant></entry>
         <entry>
          &true; para establecer de forma autom&aacute;tica el campo <literal>Referer:</literal> en 
		  las peticiones que siguen las redirecciones de tipo <literal>Location:</literal>.
         </entry>
         <entry>
          Available since PHP 5.1.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_BINARYTRANSFER</constant></entry>
         <entry>
          &true; para devolver la salida completa cuando se usa <constant>CURLOPT_RETURNTRANSFER</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_COOKIESESSION</constant></entry>
         <entry>
          &true; para marcar esta cookie como una nueva cookie de sesi&oacute;n. 
		  Obliga a libcurl a ignorar todas las cookies que va a cargar y que son 
		  cookies de sesi&oacute;n de una sesi&oacute;n anterior. Por defecto, 
		  libcurl guarda y carga todas las cookies, independientemente de si son de 
		  sisi&oacute; o no. Las cookies de sesi&oacute;n son las cookies que no 
		  tienen establecida una fecha de expiraci&oacute;n y que se supone que 
		  solamente deben aplicarse y existir en esta sesi&oacute;n.
         </entry>
         <entry>
          Disponible desde PHP 5.1.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_CRLF</constant></entry>
         <entry>
          &true; para convertir los caracteres de nueva l&iacute;nea de Unix a caracteres de nueva l&iacute;nea de tipo CRLF en las transferencias.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_DNS_USE_GLOBAL_CACHE</constant></entry>
         <entry>
          &true; para utilizar una cache de DNS global. Esta opci&oacute;n no es compatible con entornos multi-hilo y por defecto est&aacute; activada.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FAILONERROR</constant></entry>
         <entry>
          &true; para que la ejecuci&oacute;n de la funci&oacute;n falle de forma "silenciosa" si el 
			 c&oacute;digo HTTP devuelto es mayor que 300. El comportamiento por 
			 defecto es devolver la p&aacute;gina normalmente, ignorando el c&oacute;digo.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FILETIME</constant></entry>
         <entry>
          &true; para intentar obtener la fecha remota de modificaci&oacute;n 
			 del documento. Se puede obtener el valor empleando la opci&oacute;n 
			 <parameter>CURLINFO_FILETIME</parameter> con la funci&oacute;n <function>curl_getinfo</function>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FOLLOWLOCATION</constant></entry>
         <entry>
          &true; para seguir las cabeceras <literal>"Location: "</literal> que puede enviar 
			 el servidor junto con el resto de las cabeceras HTTP (se debe tener en cuenta que el comportamiento es recursivo, 
			 por lo que PHP seguir&aacute; tantos encabezados <literal>"Location: "</literal> como se envien, a no ser 
			 que se establezca la opci&oacute;n <constant>CURLOPT_MAXREDIRS</constant>).	 
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FORBID_REUSE</constant></entry>
         <entry>
          &true; para forzar que la conexi&oacute;n se cierre de forma expl&iacute;cita cuando la transmisi&oacute;n ha 
			 finalizado y por tanto que no se reserve para su posterior reutilizaci&oacute;n.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FRESH_CONNECT</constant></entry>
         <entry>
          &true; para forzar el uso de una conexi&oacute;n nueva en vez de reutilizar una conexi&oacute;n cacheada.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTP_USE_EPRT</constant></entry>
         <entry>
          &true; para emplear EPRT (y LPRT) cuando se est&aacute;n realizado descargas de tipo FTP. Se puede indicar &false; 
			 para deshabilitar EPRT y LPRT y utilizar solamente PORT.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTP_USE_EPSV</constant></entry>
         <entry>
          &true; para intentar en primer lugar un comando de tipo EPSV en las transferencias FTP y en segundo lugar un comando de tipo 
			 PASV. Se puede indicar &false; para deshabilitar EPSV.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTPAPPEND</constant></entry>
         <entry>
          &true; para escribir a partir del final del archivo remoto en vez de sobreescribirlo.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTPASCII</constant></entry>
         <entry>
          Se trata de un alias de la opci&oacute;n <constant>CURLOPT_TRANSFERTEXT</constant>, que se recomienda utilizar en vez de esta opci&oacute;n.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTPLISTONLY</constant></entry>
         <entry>
          &true; para obtener el listado de los elementos de un directorio de FTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HEADER</constant></entry>
         <entry>
          &true; para que el encabezado se incluya en la salida.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HTTPGET</constant></entry>
         <entry>
          &true; para volver a establecer el m&eacute;todo HTTP al tipo GET.
          El m&eacute;todo por defecto es GET, as&iacute; que solamente es necesaria esta opci&oacute;n 
			 si el m&eacute;todo ha sido modificado.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HTTPPROXYTUNNEL</constant></entry>
         <entry>
          &true; para encaminar la transferencia a trav&eacute;s de un tunel establecido con el servidor proxy HTTP indicado.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_MUTE</constant></entry>
         <entry>
          &true; para que las funciones CURL se comporten de forma completamente "silenciosa".
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_NETRC</constant></entry>
         <entry>
          &true; para obtener el nombre de usuario y la contrase&ntilde;a necesarios para acceder a un sitio 
			 remoto a partir del archivo <filename>~/.netrc</filename>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_NOBODY</constant></entry>
         <entry>
          &true; para no incluir en la salida el contenido del body.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_NOPROGRESS</constant></entry>
         <entry>
          &true; para deshabilitar el medidor del progreso de las transferencias de tipo CURL.
          <note>
           <para>
            PHP por defecto establece esta opci&oacute;n como &true;, por lo que solamente deber&iacute; cambiarse su 
			   valor para tareas de depuraci&oacute;n.
           </para>
          </note>
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_NOSIGNAL</constant></entry>
         <entry>
          &true; para que ninguna de las se&ntilde;ales generadas por las funciones CURL 
			 se notifiquen la proceso de PHP. En entornos de ejecuci&oacute;n de SAPIs multi-hilo est&aacute; 
			 activado por defecto, de forma que las opciones de timeout puedan utilizarse.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de CURL 7.10 y de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_POST</constant></entry>
         <entry>
          &true; para ejecutar una petici&oacute;n de tipo HTTP POST. El m&eacute;todo empleado por el POST es el de 
			 <literal>application/x-www-form-urlencoded</literal>, que es el habitualmente empleado por los formularios HTML.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PUT</constant></entry>
         <entry>
          &true; para ejecutar el m&eacute;todo HTTP PUT sobre un archivo. El archivo debe indicarse mediante las opciones 
			 <constant>CURLOPT_INFILE</constant> y <constant>CURLOPT_INFILESIZE</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_RETURNTRANSFER</constant></entry>
         <entry>
          &true; para devolver el resultado como una cadena de texto que contiene el valor devuelto por la 
			 funci&oacute;n <function>curl_exec</function>, en vez de mostrar la salida directamente en la ventana del 
			 navegador.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSL_VERIFYPEER</constant></entry>
         <entry>
          &false; para evitar que CURL verifique el certificado del otro extremo.
			 Se pueden especificar otros certificados para verificar mediante la opci&oacute;n 
			 <constant>CURLOPT_CAINFO</constant> y tambi&eacute;n se puede especificar un 
			 directorio de certificados mediante la opci&oacute;n <constant>CURLOPT_CAPATH</constant>.
			 La opci&oacute;n <constant>CURLOPT_SSL_VERIFYHOST</constant> se debe establecer a 
          &true; o &false; si la opci&oacute;n <constant>CURLOPT_SSL_VERIFYPEER</constant> 
			 est&aacute; deshabilitada (su valor por defecto es 2).
         </entry>
         <entry>
          &true; por defecto en la versi&oacute;n CURL 7.10. Conjunto instalado por defecto con la versi&oacute;n CURL 7.10.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_TRANSFERTEXT</constant></entry>
         <entry>
          &true; para emplear el modo de transmisi&oacute;n ASCII en las transferencias de FTP.
          Para LDAP, obtiene los datos en formato de texto plano en vez de en formato HTML.
		  En los sistemas Windows, no establece la salida <literal>STDOUT</literal> a modo binario.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_UNRESTRICTED_AUTH</constant></entry>
         <entry>
          &true; para enviar el nombre de usuario y la contrase&ntilde;a cuando se siguen las cabeceras de tipo 
			 <literal>"Location: "</literal> (al activar la opci&oacute;n <constant>CURLOPT_FOLLOWLOCATION</constant>).
			 El nombre de usuario y contrase&ntilde;a se env&iacute;n aun cambiando el nombre del host en las redirecciones.
         </entry>
         <entry>
          Se incluy&oacute; en la version de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_UPLOAD</constant></entry>
         <entry>
          &true; para preparar una subida.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_VERBOSE</constant></entry>
         <entry>
          &true; para obtener la informaci&oacute;n completa sobre la salida. La salida se escribe en 
			 <literal>STDERR</literal> o en el fichero especificado mediante la opci&oacute;n <constant>CURLOPT_STDERR</constant>.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     El par&aacute;metro <parameter>value</parameter> debe ser un entero para los siguientes 
		valores del par&aacute;metro <parameter>option</parameter>:
     <informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_BUFFERSIZE</constant></entry>
         <entry>
          El tama&ntilde;o del buffer que se va a utilizar en cada operaci&oacute;n de lectura. No se garantiza 
			 que la petici&oacute;n consiga llenar el buffer.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de CURL 7.10 y de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_CLOSEPOLICY</constant></entry>
         <entry>
          Puede ser o <parameter>CURLCLOSEPOLICY_LEAST_RECENTLY_USED</parameter> o 
			 <parameter>CURLCLOSEPOLICY_OLDEST</parameter>. Existen otros tres valores 
			 para <literal>CURLCLOSEPOLICY_</literal>, pero CURL no los soporta todav&iacute;.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_CONNECTTIMEOUT</constant></entry>
         <entry>
          El n&uacute;mero de segundos que se pueden esperar como m&aacute;ximo intentando 
			 establecer la conexi&oacute;n. Si se le da un valor de 0 (cero), se espera 
			 indefinidamente.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_DNS_CACHE_TIMEOUT</constant></entry>
         <entry>
          El n&uacute;mero de segundos que se mantienen las entradas de DNS en memoria. Por defecto toma 
			 un valor de 120 segundos (2 minutos).
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTPSSLAUTH</constant></entry>
         <entry>
          El m&eacute;todo de autenticaci&oacute;n de FTP (si se utiliza autenticaci&oacute;n):
          <literal>CURLFTPAUTH_SSL</literal> (intentar primero SSL),
          <literal>CURLFTPAUTH_TLS</literal> (intentar primero TLS) o 
          <literal>CURLFTPAUTH_DEFAULT</literal> (dejar que CURL decida el m&eacute;todo).
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de CURL 7.12.2 y de PHP 5.1.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HTTP_VERSION</constant></entry>
         <entry>
          <parameter>CURL_HTTP_VERSION_NONE</parameter> (por defecto se deja a CURL 
			 que decida que versi&oacute;n usar),
          <parameter>CURL_HTTP_VERSION_1_0</parameter> (fuerza a usar HTTP/1.0),
          o <parameter>CURL_HTTP_VERSION_1_1</parameter> (fuerza a usar HTTP/1.1).
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HTTPAUTH</constant></entry>
         <entry>
          <para>
           El m&eacute;todo de autenticaci&oacute;n HTTP a utilizar. Las opciones son:
           <parameter>CURLAUTH_BASIC</parameter>,
           <parameter>CURLAUTH_DIGEST</parameter>,
           <parameter>CURLAUTH_GSSNEGOTIATE</parameter>,
           <parameter>CURLAUTH_NTLM</parameter>,
           <parameter>CURLAUTH_ANY</parameter> y 
           <parameter>CURLAUTH_ANYSAFE</parameter>.
          </para>
          <para>
           Se puede utilizar el operador bitwise <literal>|</literal> (conocido como "or") para combinar 
			  m&aacute;s de un m&eacute;todo. Si se utiliza una combinaci&oacute;n de m&eacute;todos, CURL 
			  sondea al servidor para comprobar qu&eacute; m&eacute;todos soporta y as&iacute; elegir el 
			  mejor de los soportados.
          </para>
          <para>
           <parameter>CURLAUTH_ANY</parameter> es un alias de 
           <literal>CURLAUTH_BASIC | CURLAUTH_DIGEST | CURLAUTH_GSSNEGOTIATE | CURLAUTH_NTLM</literal>.
          </para>
          <para>
           <parameter>CURLAUTH_ANYSAFE</parameter> es un alias de 
           <literal>CURLAUTH_DIGEST | CURLAUTH_GSSNEGOTIATE | CURLAUTH_NTLM</literal>.
          </para>
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_INFILESIZE</constant></entry>
         <entry>
          El tama&ntilde;o esperado en bytes del archivo empleado en una operaci&oacute;n 
			 de subida de un archivo a un sitio remoto.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_LOW_SPEED_LIMIT</constant></entry>
         <entry>
          La velocidad de transmisi&oacute;n, en bytes por segundo, que la transferencia 
			 debe obtener de manera continua durante <constant>CURLOPT_LOW_SPEED_TIME</constant> segundos 
			 para que PHP considere la transferencia demasiado lenta y la aborte.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_LOW_SPEED_TIME</constant></entry>
         <entry>
          El n&uacute;mero de segundos que la transferencia debe obtener de manera 
			 continua una velocidad de transferencia inferior a <constant>CURLOPT_LOW_SPEED_LIMIT</constant> 
			 bytes por segundo para que PHP considere la transferencia demasiado lenta y la aborte.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_MAXCONNECTS</constant></entry>
         <entry>
          El n&uacute;mero m&aacute;ximo de conexiones persistentes permitidas.
		  Cuando se alcanza el l&iacute;mite establecido, se utiliza la opci&oacute;n 
		  <constant>CURLOPT_CLOSEPOLICY</constant> para determinar que conexi&oacute;n se cierra.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_MAXREDIRS</constant></entry>
         <entry>
          El n&uacute;mero m&aacute;ximo de redirecciones HTTP que se siguen. 
			 Se utiliza junto con la opci&oacute;n <constant>CURLOPT_FOLLOWLOCATION</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PORT</constant></entry>
         <entry>
          Un n&uacute;mero de puerto alternativo para realizar la conexi&oacute;n.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PROXYAUTH</constant></entry>
         <entry>
         Los m&eacute;todos de autenticaci&oacute;n HTTP empleados para una conexi&oacute;n proxy.
			 Se emplean las mismas m&aacute;scaras de bits que las descritas para la opci&oacute;n 
         <constant>CURLOPT_HTTPAUTH</constant>. Para la autenticaci&oacute;n proxy, solo se 
			 permiten los valores <parameter>CURLAUTH_BASIC</parameter> y <parameter>CURLAUTH_NTLM</parameter>.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de CURL 7.10.7 y de PHP 5.1.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PROXYPORT</constant></entry>
         <entry>
          El n&uacute;mero de puerto que se utiliza en las conexiones proxy. 
			 Este n&uacute;mero se puede establecer tambi&eacute;n mediante 
			 la opci&oacute;n <constant>CURLOPT_PROXY</constant>.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PROXYTYPE</constant></entry>
         <entry>
          Puede tomar el valor <parameter>CURLPROXY_HTTP</parameter> (valor por defecto) o
          <parameter>CURLPROXY_SOCKS5</parameter>.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de CURL 7.10 y de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_RESUME_FROM</constant></entry>
         <entry>
          La posici&oacute;n en bytes desde la que se reanuda la transferencia.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSL_VERIFYHOST</constant></entry>
         <entry>
          1 para comprobar la existencia de un nombre com&uacute;n en el certificado SSL del otro extremo.
			 2 para comprobar la existencia de un nombre com&uacute;n y adem&aacute;s comprobar 
			 si coincide el nombre del host proporcionado.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLVERSION</constant></entry>
         <entry>
          La versi&oacute;n de SSL a utilizar (puede ser 2 o 3). Por defecto PHP trata de 
			 determinarlo por si mismo, aunque en algunos casos puede ser necesario 
			 indicarlo manualmente.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_TIMECONDITION</constant></entry>
         <entry>
          Manera en la que se trata la opci&oacute;n <constant>CURLOPT_TIMEVALUE</constant>.
          Si se indica el valor <parameter>CURL_TIMECOND_IFMODSINCE</parameter>, se devuelve la p&aacute;gina 
			 solamente si ha sido modificada desde la fecha indicada en la opci&oacute;n <constant>CURLOPT_TIMEVALUE</constant>. 
			 Si no ha sido modificada, se devuelve una cabecera de tipo <literal>"304 Not Modified"</literal> si la opci&oacute;n 
			 <constant>CURLOPT_HEADER</constant> es &true;.
          Si se indica el valor <parameter>CURL_TIMECOND_ISUNMODSINCE</parameter> el efecto conseguido es el contrario. El valor 
			 por defecto es <parameter>CURL_TIMECOND_IFMODSINCE</parameter>.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de PHP 5.1.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_TIMEOUT</constant></entry>
         <entry>
          El n&uacute;mero m&aacute;ximo de segundos que CURL espera a que se ejecuten las funciones.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_TIMEVALUE</constant></entry>
         <entry>
          La fecha en n&uacute;mero de segundos transcurridos desde el 1 de Enero de 1970. 
			 La fecha se utiliza con la opci&oacute;n <constant>CURLOPT_TIMECONDITION</constant>. 
			 Por defecto, se utiliza el par&aacute;metro <parameter>CURL_TIMECOND_IFMODSINCE</parameter>.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     <parameter>value</parameter> debe ser una cadena de texto para los siguientes valores del 
		par&aacute;metro <parameter>option</parameter>:
     <informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de  <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_CAINFO</constant></entry>
         <entry>
          El nombre del archivo que contiene uno o m&aacute;s certificados utilizados 
			 para la verificaci&oacute;n con el otro extremo. Solamente es &uacute;til 
			 cuando se utiliza conjuntamente con la opci&oacute;n <constant>CURLOPT_SSL_VERIFYPEER</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_CAPATH</constant></entry>
         <entry>
          El directorio que contiene los certificados de las CA. Se utiliza junto con la 
			 opci&oacute;n <constant>CURLOPT_SSL_VERIFYPEER</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_COOKIE</constant></entry>
         <entry>
          El contenido de la cabecera <literal>"Set-Cookie: "</literal> que se utiliza 
			 en la petici&oacute;n HTTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_COOKIEFILE</constant></entry>
         <entry>
          El nombre del archivo que contiene los datos de las cookies. El archivo 
			 puede tener el formato definido por Netscape o el formato de cabeceras HTTP 
			 volcadas directamente a un archivo en texto plano.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_COOKIEJAR</constant></entry>
         <entry>
          El nombre del archivo en el que se guardan todas las cookies internas 
			 cuando se cierra la conexi&oacute;n.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_CUSTOMREQUEST</constant></entry>
         <entry>
          Un m&eacute;todo personalizado a utilizar en lugar de 
          <literal>"GET"</literal> o <literal>"HEAD"</literal> cuando se 
			 hace una petici&oacute;n HTTP. Se utiliza cuando se quieren realizar peticiones 
			 HTTP no habituales como por ejemplo <literal>"DELETE"</literal>.
          Los valores v&aacute;lidos son del tipo <literal>"GET"</literal>,
          <literal>"POST"</literal>, <literal>"CONNECT"</literal> y similares;
          esto es, no se debe introducir un valor complejo como por ejemplo 
			 <literal>"GET /index.html HTTP/1.0\r\n\r\n"</literal>.
          <note>
           <para>
            No se deben emplear m&eacute;todos personalizados si no se est&aacute; seguro de que 
			   el servidor remoto los soporta.
           </para>
          </note>
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_EGBSOCKET</constant></entry>
         <entry>
          Es como <constant>CURLOPT_RANDOM_FILE</constant>, salvo que se indica un socket al 
			 demonio generador de entrop&iacute;a.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_ENCODING</constant></entry>
         <entry>
          Los contenidos de la cabecera <literal>"Accept-Encoding: "</literal>.
          De esta forma, se permite la decodificaci&oacute;n de la respuesta.
		  Los valores permitidos son los de <literal>"identity"</literal>, <literal>"deflate"</literal> y
          <literal>"gzip"</literal>. Si se indica una cadena vac&iacute; (<literal>""</literal>),
          se env&iacute;a una cabecera que incluye todos los tipos de codificaci&oacute;n.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute;n de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_FTPPORT</constant></entry>
         <entry>
          El valor que se utiliza para obtener la direcci&oacute;n IP 
			 que se emplea en la instrucci&oacute;n "POST" de FTP. La instrucci&oacute;n 
			 "POST" indica al servidor remoto que se conecte a la direcci&oacute;n IP 
			 especificada. La cadena puede ser una direcci&oacute;n IP, el nombre 
			 de un host, el nombre de un interfaz de red (en entornos Unix) o el valor 
			 '-' para utilizar la direcci&oacute;n IP por defecto del sistema.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_INTERFACE</constant></entry>
         <entry>
          El nombre del interfaz de red de salida a utilizar. Se puede indicar 
			 como nombre de interfaz, direcci&oacute;n IP o nombre de host.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_KRB4LEVEL</constant></entry>
         <entry>
          El nivel de seguridad de KRB4 (Kerberos 4). Se permite cualquiera de los siguientes valores 
          (ordenados de menos a m&acute;s fuerte):
          <literal>"clear"</literal>,
          <literal>"safe"</literal>,
          <literal>"confidential"</literal>,
          <literal>"private".</literal>.
          Si la cadena proporcionada no contiene ninguno de esos valores, se utiliza el valor <literal>"private"</literal>.
		  Si se proporciona un valor de &null;, se deshabilita la seguridad KRB4. Actualmente, este tipo de seguridad 
			 solamente funciona en las transferencias FTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_POSTFIELDS</constant></entry>
         <entry>
          Los datos a enviar en una operaci&oacute;n de tipo HTTP "POST".
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PROXY</constant></entry>
         <entry>
          El proxy HTTP a trav&eacute;s del que se encaminan las peticiones.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PROXYUSERPWD</constant></entry>
          <entry>
           El nombre de usuario y contrase&ntilde;a (indicados con el formato 
           <literal>"[username]:[password]"</literal>) que se van a utilizar para 
			  realizar la conexi&oacute;n con el proxy.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_RANDOM_FILE</constant></entry>
         <entry>
          El nombre del archivo que se va a emplear para alimentar el 
			 generador de n&uacute;meros aleatorios empleado por SSL.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_RANGE</constant></entry>
         <entry>
          Rango de datos que se quieren obtener indicados de la forma 
          <literal>"X-Y"</literal>, donde X o Y son opcionales. Las transferencias HTTP soportan 
			 varios rangos diferentes simultaneos separados por comas, de la forma <literal>"X-Y,N-M"</literal>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_REFERER</constant></entry>
         <entry>
          El contenido de la cabecera <literal>"Referer: "</literal> empleada en la petici&oacute;n HTTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSL_CIPHER_LIST</constant></entry>
         <entry>
          La lista de algoritmos de tipo cipher a emplear por SSL. Los siguientes valores 
			 son v&aacute;lidos: <literal>RC4-SHA</literal> y <literal>TLSv1</literal>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLCERT</constant></entry>
         <entry>
          El nombre del archivo que contiene el certificado almacenado en formato PEM.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLCERTPASSWD</constant></entry>
         <entry>
          La contrase&ntilde;a necesaria para utilizar el certificado <constant>CURLOPT_SSLCERT</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLCERTTYPE</constant></entry>
         <entry>
	      El formato del certificado. Los formatos soportados son 
          <literal>"PEM"</literal> (valor por defecto), <literal>"DER"</literal>
          y <literal>"ENG"</literal>.
         </entry>
         <entry>
          se incluy&oacute; en la versi&oacute;n de CURL 7.9.3 y de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLENGINE</constant></entry>
         <entry>
          El identificador del generador criptogr&aacute;fico de la clave privada 
			 de SSL especificada en la opci&oacute;n <constant>CURLOPT_SSLKEY</constant>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLENGINE_DEFAULT</constant></entry>
         <entry>
          El identificador del generador criptogr&aacute;fico empleado en las 
			 operaciones criptogr&aacute;ficas sim&eacute;tricas.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLKEY</constant></entry>
         <entry>
          El nombre del archivo que contiene la clave privada de SSL.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLKEYPASSWD</constant></entry>
         <entry>
          La contrase&ntilde;a secreta necesaria para utilizar la clave privada de SSL 
			 especificada en la opci&oacute; <constant>CURLOPT_SSLKEY</constant>.
          <note>
           <para>
            Como esta opci&oacute; requiere del uso de una contrase&ntilde;a que debe almacenarse 
			   en un lugar seguro, recuerde mantener el script de PHP en un entorno de ejecuci&oacute;n seguro.
           </para>
          </note>
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_SSLKEYTYPE</constant></entry>
         <entry>
          El tipo de clave privada de SSL especificada en <constant>CURLOPT_SSLKEY</constant>. 
			 Los valores permitidos son <literal>"PEM"</literal> (valor por defecto), <literal>"DER"</literal>
          y <literal>"ENG"</literal>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_URL</constant></entry>
         <entry>
          La URL que se quiere obtener. Tambi&eacute;n se puede establecer su valor 
			 al inicializar una sesi&oacute;n con la funci&oacute;n <function>curl_init</function>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_USERAGENT</constant></entry>
         <entry>
          El contenido de la cabecera <literal>"User-Agent: "</literal> enviada en las peticiones HTTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_USERPWD</constant></entry>
         <entry>
          El nombre de usuario y contrase&ntilde;a (con el formato 
          <literal>"[username]:[password]"</literal>) que se va a utilizar para realizar la conexi&oacute;n.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     <parameter>value</parameter> deber&iacute;a ser una variable de tipo array para los 
		siguientes valores del par&aacute;metro <parameter>option</parameter>:
     <informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_HTTP200ALIASES</constant></entry>
         <entry>
          Array de respuestas HTTP de tipo 200 que se tratar&aacute;n como 
			 respuestas v&aacute;lidas y no errores.
         </entry>
         <entry>
          Se incluy&oacute; en la versi&oacute; de CURL 7.10.3 y de PHP 5.0.0.
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_HTTPHEADER</constant></entry>
         <entry>
          Array de valores de cabeceras HTTP que se van a enviar.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_POSTQUOTE</constant></entry>
         <entry>
          Array de comandos FTP que se van a ejecutar en el servidor remoto despu&eacute;s de que 
			 se haya ejecutado la petici&oacute;n FTP.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_QUOTE</constant></entry>
         <entry>
          Array de comandos FTP que se van a ejecutar en el servidor remoto antes de que 
			 se haya ejecutado la petici&oacute;n FTP.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     <parameter>value</parameter> debe ser un recurso de tipo stream (obtenido por ejemplo 
		mediante la funci&oacute;n <function>fopen</function>) para los siguientes valores del par&aacute;metro <parameter>option</parameter>:
     <informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_FILE</constant></entry>
         <entry>
          Archivo al que se van a volcar los datos de la transferencia. Por defecto es <literal>STDOUT</literal> 
			 (por tanto, generalmente la ventana del navegador).
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_INFILE</constant></entry>
         <entry>
          Archivo del que la transferencia debe obtener los datos para las peticiones de tipo subida.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_STDERR</constant></entry>
         <entry>
          Recurso alternativo para escribir los errores producidos en lugar de <literal>STDERR</literal>.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_WRITEHEADER</constant></entry>
         <entry>
          Archivo en el que se escribe la parte de las cabeceras de la transferencia.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     <parameter>value</parameter> debe ser una cadena de texto con el nombre v&aacute;lido de una funci&oacute;n de tipo 
     callback para los siguientes valores del par&aacute;metro <parameter>option</parameter>:
     <informaltable>
      <tgroup cols="3">
       <thead>
        <row>
         <entry>Opci&oacute;n</entry>
         <entry>Valor de <parameter>value</parameter></entry>
         <entry>Notas</entry>
        </row>
       </thead>
       <tbody>
        <row>
         <entry><constant>CURLOPT_HEADERFUNCTION</constant></entry>
         <entry>
          Nombre de la funci&oacute;n de callback que requiere de 2 argumentos. 
			 El primero es el recurso CURL y el segundo es una cadena que contiene 
			 los datos de la cabecera que se deben escribir. Si se utiliza esta funci&oacute;n 
			 de callback, el programador tiene la responsabilidad de escribir los 
			 datos de la cabecera. La funci&oacute;n devuelve el n&uacute;mero de bytes escritos.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_PASSWDFUNCTION</constant></entry>
         <entry>
          Nombre de la funci&oacute;n de callback que requiere de 3 argumentos. 
          El primero es el recurso CURL, el segundo es una cadena de texto que solicita 
			 que se introduzca una contrase&ntilde;a y el tercero es la longitud m&aacute;xima 
			 de la contrase&ntilde;a. La funci&oacute;n devuelve una cadena de texto que 
			 contiene la contrase&ntilde;a.
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_READFUNCTION</constant></entry>
         <entry>
          Nombre de la funci&oacute;n de callback que requiere de 2 argumentos.
		  El primero es el recurso CURL y el segundo es una cadena con los datos 
          a leer. Si se  utiliza esta funci&oacute;n, el programador tiene la responsabilidad 
			 de leer los datos. La funci&oacute;n devuelve el n&uacute;mero de bytes leidos y 
			 devuelve 0 (cero) si se llega al final del archivo (<literal>EOF</literal>).
         </entry>
         <entry>
         </entry>
        </row>
        <row>
         <entry><constant>CURLOPT_WRITEFUNCTION</constant></entry>
         <entry>
          Nombre de la funci&oacute;n de callback que requiere de 2 argumentos.
		  El primero es el recurso CURL y el segundo es una cadena de texto con los 
          datos a escribir. Si se  utiliza esta funci&oacute;n, el programador tiene la responsabilidad 
			 de escribir los datos. La funci&oacute;n debe devolver el n&uacute;mero exacto de 
			 bytes que se han escrito o se producir&aacute; un error.
         </entry>
         <entry>
         </entry>
        </row>
       </tbody>
      </tgroup>
     </informaltable>
    </para>
    <para>
     <example>
      <title>
       Inicializar una nueva sesi&oacute;n CURL y obtener una p&aacute;gina web
      </title>
      <programlisting role="php">
<![CDATA[
<?php
// Se crea un manejador CURL
$ch = curl_init();

// Se establece la URL y algunas opciones
curl_setopt($ch, CURLOPT_URL, "http://www.example.com/");
curl_setopt($ch, CURLOPT_HEADER, false);

// Se obtiene la URL indicada
curl_exec($ch);

// Se cierra el recurso CURL y se liberan los recursos del sistema
curl_close($ch);
?>
]]>
      </programlisting>
     </example>
    </para>
   </refsect1>
  </refentry>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
