<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.1 $ -->
<!-- EN-Revision: 1.1 Maintainer: lboshell Status: ready -->
<!-- splitted from ./en/functions/pcre.xml, last change in rev 1.2 -->
  <refentry id="pcre.pattern.modifiers">
   <refnamediv>
    <refname>Modificadores de Patr&oacute;n</refname>
    <refpurpose>Describe los posibles modificadores en patrones de
     expresiones regulares</refpurpose>
   </refnamediv>
   <refsect1>
    <title>Descripci&oacute;n</title>
    <para>
     Los modificadores PCRE disponibles en la actualidad son listados
     a continuaci&oacute;n. Los nombres entre par&eacute;ntesis se
     refieren a nombres internos de PCRE para dichos modificadores.
    </para>
    <para>
     <blockquote>
      <variablelist>
       <varlistentry>
    <term><emphasis>i</emphasis> (PCRE_CASELESS)</term>
    <listitem>
     <simpara>
      Si &eacute;ste modificador es definido, las letras en el
      patr&oacute;n coincidir&aacute;n tanto con letras
      may&uacute;sculas como min&uacute;sculas.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>m</emphasis> (PCRE_MULTILINE)</term>
    <listitem>
     <simpara>
      Por defecto, PCRE trata la cadena de asunto como si consistiera
      de una "&uacute;nica" l&iacute;nea de caracteres (aun si en
      realidad contiene varias). El meta-caracter de "inicio de
      l&iacute;nea" (^) coincide s&oacute;lo al principio de la
      cadena, mientras que el meta-caracter de "fin de l&iacute;nea"
      ($) coincide s&oacute;lo el final de la cadena, o antes un
      caracter de nueva l&iacute;nea final (a menos que el
      modificador <emphasis>D</emphasis> sea definido). Esto es igual
      que en Perl.
     </simpara>
     <simpara>
      Cuando este modificador es definido, los constructores de
      "inicio de l&iacute;nea" y "fin de l&iacute;nea" coinciden
      inmediatamente despu&eacute;s o inmediatamente antes de
      cualquier caracter de nueva l&iacute;nea, respectivamente, al
      igual que al comienzo o final absoluto de la cadena. Este
      comportamiento es equivalente al modificador /m del Perl. Si no
      hay caracteres "\n" en la cadena de asunto, o no hay ocurrencias
      de ^ o $ en un patr&oacute;n, este modificador no tiene efecto
      alguno.
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry>
    <term><emphasis>s</emphasis> (PCRE_DOTALL)</term>
    <listitem>
     <simpara>
      Si se define &eacute;ste modificador, un meta-caracter de punto
      en el patr&oacute;n coincidir&aacute; con todos los caracteres,
      incluyendo el de nueva l&iacute;nea. Sin &eacute;l, los saltos
      de l&iacute;nea son exclu&iacute;dos. Este modificador es
      equivalente a /s en Perl. Una clase negativa como [^a] siempre
      coincide con un caracter de nueva l&iacute;nea,
      independientemente del uso de este modificador.
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry>
    <term><emphasis>x</emphasis> (PCRE_EXTENDED)</term>
    <listitem>
     <simpara>
      Si &eacute;ste modificador es definido, los caracteres de datos
      que representan espacios en blanco en el patr&oacute;n son
      completamente ignorados, excepto cuando son escapados o cuando
      se encuentran al interior de una clase caracter, y los
      caracteres entre un # sin escapar fuera de una clase de caracter
      y el siguiente caracter de nueva l&iacute;nea, inclusive, son
      ignorados tambi&eacute;n. Esto es equivalente al modificador /x
      de Perl y hace posible incluir comentarios al interior de
      patrones complicados. Note, sin embargo, que esto es s&oacute;lo
      aplicable a caracteres de datos. Los caracteres de espacio en
      blanco nunca pueden aparecer en secuencias de caracteres
      especiales en un patr&oacute;n, por ejemplo al interior de la
      secuencia (?(, la cual inicia un sub-patr&oacute;n condicional.
     </simpara>
    </listitem>
   </varlistentry>
   <varlistentry>
    <term><emphasis>e</emphasis></term>
    <listitem>
     <simpara>
      Si &eacute;ste modificador es
      usado, <function>preg_replace</function> realiza las
      sustituciones normales de referencias hacia atr&aacute;s en la
      cadena de reemplazo, eval&uacute;a &eacute;sta como
      c&oacute;digo PHP y usa el resultado para reemplazar la cadena
      de b&uacute;squeda.
     </simpara>
     <para>
      S&oacute;lo <function>preg_replace</function> usa &eacute;ste
      modificador; es ignorado por otras funciones de PCRE.
      <note>
       <simpara>
        Este modificador no se encontraba disponible en PHP 3.
       </simpara>
      </note>
     </para>
    </listitem>
   </varlistentry>
   <varlistentry>
    <term><emphasis>A</emphasis> (PCRE_ANCHORED)</term>
    <listitem>
     <simpara>
      Si &eacute;ste modificador es definido, el patr&oacute;n es
      obligado a ser "anclado", es decir, es limitado para que
      coincida s&oacute;lo al inicio de la cadena que est&aacute;
      siendo analizada (la "cadena de asunto"). Este efecto puede
      alcanzarse tambi&eacute;n mediante las construcciones apropiadas
      en el patr&oacute;n mismo, la cual es la &uacute;nica manera de
      hacerlo en Perl.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>D</emphasis> (PCRE_DOLLAR_ENDONLY)</term>
    <listitem>
     <simpara>
      Si &eacute;ste modificador es definido, un meta-caracter de
      signo d&oacute;lar en el patr&oacute;n coincide
      &uacute;nicamente al final de la cadena de asunto. Sin
      &eacute;ste modificador, un d&oacute;lar coincide tambi&eacute;n
      inmediatamente antes del caracter final si &eacute;ste es un
      salto de l&iacute;nea (pero no antes de cualquier otra nueva
      l&iacute;nea). Este modificador es ignorado
      si <emphasis>m</emphasis> es definido. No hay equivalente en
      Perl para este modificador.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>S</emphasis></term>
    <listitem>
     <simpara>
      Cuando un patr&oacute;n va a ser usado varias veces, vale la
      pena dedicar m&aacute;s tiempo a analizarlo para acelerar el
      proceso de comparaciones. Si &eacute;ste modificador es
      definido, entonces se realizar&aacute; este an&aacute;lisis
      adicional. Por el momento, el estudio de un patr&oacute;n es
      &uacute;til s&oacute;lo para patrones no-anclados que no tienen
      un car&aacute;cter de inicio &uacute;nico arreglado.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>U</emphasis> (PCRE_UNGREEDY)</term>
    <listitem>
     <simpara>
      Este modificador invierte la "ambici&oacute;n" de los
      cuantificadores, de modo que no sean codiciosos por defecto, en
      su lugar se vuelven codiciosos si son seguidos por un "?". No es
      compatible con Perl. Tambi&eacute;n puede definirse con un
      modificador (?U) al interior del patr&oacute;n.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>X</emphasis> (PCRE_EXTRA)</term>
    <listitem>
     <simpara>
      Este modificador activa funcionalidad adicional de PCRE que no
      es compatible con Perl. Cualquier barra invertida en un
      patr&oacute;n que sea seguida por una letra que no tenga un
      significado especial provocar&aacute; un error, logrando en
      efecto reservar &eacute;stas combinaciones para futuras
      ampliaciones. Por defecto, como en Perl, una barra invertida
      seguida por una letra sin un significado especial es tratada
      como un literal. No hay otras caracter&iacute;sticas controladas
      por este modificador a la fecha de hoy.
     </simpara>
    </listitem>
       </varlistentry>
       <varlistentry>
    <term><emphasis>u</emphasis> (PCRE_UTF8)</term>
    <listitem>
     <simpara>
      Este modificador activa funcionalidad adicional de PCRE que no
      es compatible con Perl. Las cadenas de patrones son tratadas
      como UTF-8. Este modificador se encuentra disponible a partir de
      PHP 4.1.0 o versiones posteriores en Unix, y desde PHP 4.2.3 en
      win32.
     </simpara>
    </listitem>
       </varlistentry>
      </variablelist>
     </blockquote>
    </para>
   </refsect1>
  </refentry>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
