<?xml version="1.0" encoding="iso-8859-1"?>
<!-- splitted from ./es/functions/filesystem.xml, last change in rev 1.1 -->
<!-- last change to 'fopen' in en/ tree in rev 1.2 -->
  <refentry id="function.fopen">
   <refnamediv>
    <refname>fopen</refname>
    <refpurpose>Abre un fichero o una URL</refpurpose>
   </refnamediv>
   <refsect1>
    <title>Descripci&oacute;n</title>
     <methodsynopsis>
     <type>int</type><methodname>fopen</methodname>
     <methodparam><type>string</type><parameter>filename</parameter></methodparam>
     <methodparam><type>string</type><parameter>mode</parameter></methodparam>
     <methodparam choice="opt"><type>int</type><parameter>
       use_include_path
      </parameter></methodparam>
     </methodsynopsis>
    <simpara>
     Si <parameter>filename</parameter> comienza con "http://" (no es
     sensible a may&uacute;sculas), se abre una conexi&oacute;n HTTP 1.0 hacia el
     servidor especificado y se devuelve un apuntador de fichero al comienzo
     del texto de respuesta.
    </simpara>
    <simpara>
     No maneja redirecciones HTTP, por eso se debe incluir una barra
     final cuando se trata de directorios.
    </simpara>
    <simpara>
     Si <parameter>filename</parameter> comienza con "ftp://" (no es
     sensible a may&uacute;sculas), se abre una conexi&oacute;n ftp hacia el servidor
     especificado y se devuelve un apuntador al fichero requerido. Si el
     servidor no soporta ftp en modo pasivo, esto fallar&aacute;. Se pueden
     abrir fichero via ftp para leer o para escribir (pero no ambas
     cosas simult&aacute;neamente).
    </simpara>
    <simpara>
     Si <parameter>filename</parameter> no comienza con nada de lo anterior,
     el fichero se abre del sistema de ficheros, y se devuelve un apuntador 
     al fichero abierto.
    </simpara>
    <simpara>
     Si el abrir el fichero falla, la funci&oacute;n devuelve &false;.
    </simpara>
    <para>
     <parameter>mode</parameter> puede ser cualquiera de lo siguiente:
     <itemizedlist>
      <listitem>
       <simpara>
	'r' - Abre para s&oacute;lo lectura; sit&uacute;a el apuntador del fichero al
	comienzo del mismo.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
	'r+' - Abre para lectura y escritura; situa el apuntador del fichero
	al comienzo del fichero.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
	'w' - Abre para s&oacute;lo escritura; sit&uacute;a el apuntador del fichero al
	comienzo del fichero y trunca el fichero con longitud cero.
        Si el fichero no existe, trata de crearlo.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
	'w+' - Abre el fichero para lectura y escritura; sit&uacute;a el apuntador
	del fichero al comienzo del fichero y trunca el fichero con longitud
	cero.  Si el fichero no existe, trata de crearlo.
       </simpara>
      </listitem>
      <listitem>
       <simpara>
	'a' - Abre s&oacute;lo para escribir (a&ntilde;adir); sit&uacute;a el apuntador del fichero al 
	final del mismo. Si el fichero no existe, trata de crearlo. 
       </simpara>
      </listitem>
      <listitem>
       <simpara>
	'a+' - Abre para lectura y escritura (a&ntilde;adiendo); sit&uacute;a el apuntador
        del fichero al final del mismo. Si el fichero no existe, trata de crearlo.
       </simpara>
      </listitem>
     </itemizedlist>
     Adem&aacute;s, <parameter>mode</parameter> puede contener la letra
     'b'. Esto es &uacute;til para sistemas que diferencian entre ficheros
     binarios y de texto (ej. es in&uacute;til en Unix). Si no se necesita,
     ser&aacute; ignorado.
    </para>
    <para>
     Puede usarse el tercer par&aacute;metro opcional y fijarlo a "1", si
     tambi&eacute;n se quiere buscar el fichero en el <link
     linkend="ini.include-path">include_path</link>.
    </para>
    <para>
     <example>
      <title>Ejemplo de <function>fopen()</function></title>
      <programlisting role="php">
$fp = fopen("/home/rasmus/file.txt", "r");
$fp = fopen("http://www.php.net/", "r");
$fp = fopen("ftp://user:password@example.com/", "w");
      </programlisting>
     </example>
    </para>
    <simpara>
     Si experimentas problemas a la hora de leer y escribir a
     ficheros y estas usando la version de PHP como m&oacute;dulo para el
     servidor, recuerda que debes asegurar que los ficheros y directorios
     que estas usando son accesibles al proceso servidor.
    </simpara>
    <para>
     En la plataforma Windows, ten cuidado de escribir correctamente
     las barras invertidas en el path del fichero (poni&eacute;ndolas dobles), 
     o usa barras directas.
     <informalexample>
      <programlisting role="php"> 
$fp = fopen("c:\\data\\info.txt", "r");
      </programlisting>
     </informalexample>
    </para>
    <simpara>
     Ver tambi&eacute;n <function>fclose</function>,
     <function>fsockopen</function>, y <function>popen</function>.
    </simpara>
   </refsect1>
  </refentry>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
