<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.1 $ -->
<!-- EN-Revision: 1.1 Maintainer: rafael Status: ready -->

  <chapter id="install.general">
 <title>Consideraciones generales de instalaci&oacute;n</title>

 <para>
  Antes de instalar PHP, necesitais saber porque quereis utilizarlo. Existen
  tres campos principales en donde PHP se puede usar, tal y como se describe
  en la secci&oacute;n <link linkend="intro-whatcando">Qu&eacute; se puede
  hacer con PHP?</link>:

  <itemizedlist>
   <listitem><simpara>Scripts en la parte del servidor</simpara></listitem>
   <listitem><simpara>Scripts en linea de comandos</simpara></listitem>
   <listitem><simpara>Aplicaciones gr&aacute;ficas clientes</simpara></listitem>
  </itemizedlist>
 </para>

 <para>
  El primero es el m&aacute;s tradicional y el principal campo de trabajo. Se
  necesitan tres cosas para que funcione. El analizador PHP (CGI &oacute;
  m&oacute;dulo), un servidor web y un navegador. Dependiendo de la
  versi&oacute;n de sistema operativo que utiliceis, probablemente tengais un
  servidor web (p.ej: Apache en Linux y MacOS X &oacute; IIS en
  Windows). Tambi&eacute;n se puede alquilar espacio web en una empresa que
  ofrezca este servicio. De esta manera no se necesita instalar nada,
  solamente escribir los scripts PHP, subirlos al espacio alquilado y ver el
  resultado en vuestro navegador.  
 </para>

 <para>
  Teneis dos maneras de utilizar PHP, si instalais vosotros el servidor y
  PHP. Existen m&oacute;dulos directos (tambi&eacute;n llamados SAPI) para
  muchos servidores web, como Apache, Microsoft Internet Information Server,
  Netscape e iPlanet. Muchos otros servidores soportan ISAPI,
  (p.ej.:OmniHTTPd). Si PHP no soporta un m&oacute;dulo para tu servidor web,
  siempre se puede usar como binario CGI. Esto significa que el servidor se
  configura para usar el ejecutable para linea de comandos de PHP en el
  procesado de peticiones de ficheros PHP.  
 </para>

  <para> Si estais interesados en usar PHP desde la linea de comandos (p.ej.:
  para generar imagenes offline &oacute; procesar ficheros de textos, etc)
  necesitais el ejecutable para linea de comandos. Para m&aacute;s
  informaci&oacute;n, lea la secci&oacute;n <link
  linkend="features.commandline">Usando PHP desde la l&iacute;nea de
  comandos</link>. En este caso no se necesita ni servidor web, ni navegador.
  </para>

<para> Con PHP tambien se puede escribir aplicaciones gr&aacute;ficas usando
  la extensi&oacute;n PHP-GTK. Esta es una forma totalmente distinta de
  utilizar PHP que cuando se utiliza para escribir p&aacute;ginas web, ya que
  no se genera c&oacute;digo HTML sino que se trabaja con ventanas y objetos
  dentro de las mismas. Para m&aacute;s informaci&oacute;n sobre PHP-GTK,
  visitar <ulink url="&url.php.gtk;">las p&aacute;ginas dedicadas a esta
  extensi&oacute;n</ulink>. PHP-GTK no se incluye en la distribuci&oacute;n
  oficial de PHP.  
</para>

<para> A partir de ahora, esta secci&oacute;n tratar&aacute; sobre la
  configuraci&oacute;n de PHP con servidores web, en Unix y Windows, tanto
  como m&oacute;dulo, como binario CGI.  
</para>

<para> PHP, el c&oacute;digo fuente y distribuciones binarias para Windows se
  pueden encontrar en <ulink url="&url.php;">&url.php;</ulink>. Recomendamos
  utilizar un <ulink url="&url.mirrors;">servidor espejo</ulink> cerca de
  donde esteis para bajaros la versi&oacute;n de PHP que querais.  
</para>

</chapter>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
