<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.6 $ -->
<!-- EN-Revision: 1.26 Maintainer: rafael Status: ready -->

<!--
  TODO: add manual conventions section (eg. how to read
        function usage parts, what is fixed width, what is
        bold, what is linked
        
        add some tips about combining the versions (online-
        offline), and using "http://anymirror.php.net/funcname"
-->
<appendix id="about">
 <title>Sobre el manual</title>
 
 <sect1 id="about.formats">
  <title>Formatos</title>
  <para>
   El manual de PHP se encuentra disponible en diferentes
   formatos. Estos formatos se pueden dividir en dos grupos: formatos
   accesible en l&iacute;nea (online) y ficheros que se pueden bajar a
   tu ordenador.
  </para>
  <note>
   <para>
    Algunos editores han publicado versiones impresas de este
    manual. No podemos recomendar ninguna de ellas, ya que suelen
    quedarse obsoletas r&aacute;pidamente.
   </para>
  </note>
  <para>
   Podeis leer el manual en linea (online) en <ulink
    url="&url.php;">&url.php;</ulink> y en numerosos servidores
   espejo. Para mejorar la respuesta, deberiais utilizar el servidor
   espejo m&aacute;s cercano a vosotros. Podeis consultar el manual en
   formato HTML -impresi&oacute;n amigable- &oacute; en formato HTML
   que integra el manual en el diseno de la p&aacute;gina web del
   proyecto PHP.
  </para>
  <para>
   Una ventaja del manual en l&iacute;nea sobre la mayoria de formatos
   fuera de l&iacute;nea es la integraci&oacute;n de los <link
    linkend="about.notes">comentarios/notas de usuarios</link>.  Una
   desventaja es que teneis que estar conectados para ver consultar
   las versiones en l&iacute;nea.
  </para>
  <para>
   Existen varios formatos fuera de l&iacute;nea y el m&aacute;s
   apropiado para cada usuario depende del sistema operativo que se
   use y de tus preferencias a la hora de leer.  Informacion sobre
   como el manual es generado en tantos formatos diferentes se puede
   obtener en la seccion de este apendice titulada <link
    linkend="about.generate"> 'Como generamos los dierentes
    formatos'</link>.
  </para>
  <para>
   Los formatos m&aacute;s accesibles desde diferentes plataformas son
   HTML y texto plano.  el manual en HTML se proporciona como un unico
   fichero en HTML &oacute; como un paquete con un fichero HTML por
   secci&oacute;n. Los formatos HTML y texto plano se distribuyen como
   ficheros tar y con compresi&oacute;n bz2.
  </para>
  <para>
   Otro formato muy popular y el m&aacute;s adecuado para imprimir, es
   PDF (Adobe Acrobat).  Tenemos que advertir antes que empeceis a
   imprimir que el manual contiene casi 2000 p&aacute;ginas y se
   revisa constantemente.
  </para>
  <note>
   <para>
    Si no teneis un programa capaz de presentar ficheros PDF, podeis
    bajaros <ulink url="&url.adobe.acrobat;">Adobe Acrobat
     Reader</ulink>.
   </para>
  </note>
  <para>
   Los usuarios de ordenadores de mano compatibles con Palm, tienen
   los formatos Palm doc y iSilo. Podreis utlizar un lector de
   documentos <ulink url="&url.palm.doc;"> DOC</ulink> &oacute; <ulink
    url="&url.palm.isilo;">iSilo</ulink> para consultar la
   documentaci&oacute;n de PHP o como referencia r&aacute;pida.
  </para>
  <para>
   Para plataformas Windows, la versi&oacute;n Windows HTML Ayuda
   proporciona el formato HTML usado con la aplicacion de ayuda
   Windows HTML. Esta versi&oacute;n proporciona busqueda completa de
   texto, indice completo y marcas (bookmarks). Muchos entornos de
   desarrollo para PHP en Windows integran esta versi&oacute;n.
  </para>
  
  <!--
  mmmm, this project seems to be dead. Any news?
  <note>
  <para>
  Un projecto de Visual Basic para Linux se encuentra en fase de planificaci&oacute;n, 
  incluir&aacute; la creaci&oacute;n de "CHM Creator and Viewer" para Linux. Podeis consultar
  la p&aacute;gina en <ulink url="&url.vb4linux;">SourceForge.net</ulink> si estais
  interesados en su progreso.
 </para>
 </note>
  -->
 </sect1>
 
 <sect1 id="about.notes">
  <title>Sobre las notas de usuarios</title>
  <para>
   Las notas de usuarios juegan un importante papael en el desarrollo
   de este manual.  Permitiendo a los lectores del manual contribuir
   con ejemplos y aclaraciones desde su navegador, podemos incorporar
   estas aclaraciones en el manual. Hasta que las notas son
   incorporadas en el manual, pueden ser accedidas desde el manual en
   l&iacute;nea y algunos formatos fuera de l&iacute;nea.
  </para>
  <note>
   <para>
    Las notas de usuario no son moderadas antes de estar disponibles
    en l&iacute;nea, asi que la calidad de lo escrito asi como los
    ejemplos &oacute; incluso la veracidad de lo expuesto en la nota
    no puede ser garantizada.
   </para>
  </note>
  <note>
   <para>
    Las notas contribuidas por los usuarios son consideradas parte del
    manual de PHP. Por lo tanto estan cubiertas por la misma licencia
    que se aplica a esta documentacion (Por el momento GPL). Para mas
    detalles, podeis consultar el <link
     linkend="copyright">Copyright</link> del manual.
   </para>
  </note>
 </sect1>
 
 <sect1 id="about.prototypes">
  <title>Como interpretar la definici&oacute;n de una funci&oacute;n
   (prototipo)</title>
  <para>
   Cada funci&oacute;n est&aacute; documentada para una obtener una
   referencia r&aacute;pida, si sabemos como interpretar y entender el
   manual podremos usar PHP de una manera m&aacute;s sencilla. En vez
   de confiar en ejemplos &oacute; cortar y pegar, podeis aprender
   como interpretar las definiciones de funciones. Empecemos:
  </para>
  <note>
   <title>
    Prerequisitos: Comprensi&oacute;n b&aacute;sica de los diferentes
    <link linkend="language.types">tipos</link>
   </title>
   <para>
    Aunque PHP es un lenguaje de programaci&oacute;n relajado en lo
    referente a los tipos de variables/valores, es importante entender
    b&aacute;sicamente los diferentes <link
     linkend="language.types">tipos</link>, ya que son importantes.
   </para>
  </note>
  <para>
   Las definiciones de funciones nos dicen que tipo de valores es
   <link linkend="functions.returning-values">retornado</link>. Usemos
   la definici&oacute;n de la funci&oacute;n
   <function>strlen</function> en nuestro primer ejemplo:
  </para>
  <para>
   <screen>
strlen
    
(PHP 3, PHP 4 >= 4.0.0)
strlen -- Obtiene la longitud de una cadena.

Descripci&oacute;n
int strlen ( string str )

Retorna la longitud de una cadena.
   </screen>
  </para>
  <para>
   <table>
    <title>Explicaci&oacute;n de la definici&oacute;n de una
     funci&oacute;n</title>
    <tgroup cols="2">
     <thead>
      <row>
       <entry>Parte</entry>
       <entry>Descripci&oacute;n</entry>
      </row>
     </thead>
     <tbody>
      <row>
       <entry>
        strlen
       </entry>
       <entry>
        El nombre de la funci&oacute;n.
       </entry>
      </row>
      <row>
       <entry>
        (PHP 3, PHP 4 >= 4.0.0)
       </entry>
       <entry>
        strlen() est&aacute; disponible tanto en PHP 3 como en PHP 4
       </entry>
      </row>
      <row>
       <entry>
        int
       </entry>
       <entry>
        Tipo de valor devuelto por esta funci&oacute;n, en este caso un
        <type>entero</type> (La
        longitud de una cadena es medida en numeros)
       </entry>
      </row>
      <row>
       <entry>
        ( string str )
       </entry>
       <entry>
        El primer (y en este caso el &uacute;nico) par&aacute;metro/argumento de
        la funci&oacute;n strlen() se llama <parameter>str</parameter> y es
        una <type>cadena</type>.
       </entry>
      </row>
     </tbody>
    </tgroup>
   </table>
  </para>
  <para>
   Podriamos escribir la definicion de esta funci&oacute;n de un modo
   gen&eacute;rico:
  </para>
  <para>
   <screen role="html">
    Tipo de valor retornado - nombre de funci&oacute;n (tipo de parametro - nombre del parametro)        
   </screen>
  </para>
  <para>
   Muchas funciones tiene multiples parametros, por ejemplo
   <function>in_array</function>. Su definici&oacute;n seria:
  </para>
  <para>
   <screen role="html">    
    bool in_array ( mixed needle, array haystack [, bool strict])
   </screen>
  </para>
  <para>
   Esto significa lo siguiente, in_array() retorna un valor <link
   linkend="language.types.boolean">boolean</link>, &true; si termina
   con exito (el parametro <parameter>needle</parameter> fue
   encontrado en la matriz <parameter>haystack</parameter>) &oacute;
   &false; si falla (el parametro <parameter>needle</parameter> no fue
   encontrado en la matriz <parameter>haystack</parameter>). El primer
   parametro se llama <parameter>needle</parameter> y puede tener
   valores de diferente <link linkend="language.types">tipo</link>,
   asi que lo llamamos de tipo "<emphasis>mixed</emphasis>". Este
   parametro <parameter>needle</parameter> (lo que estamos buscando)
   puede ser un valor escalar (cadena (string), entero (integer) o
   <link linkend="language.types.float">flotante</link>(float)),
   &oacute; una <link
   linkend="language.types.array">matriz</link>. <parameter>haystack</parameter>,
   (la matriz en la que estamos buscando) es el segundo
   par&aacute;metro. El tercer parametro <emphasis>opcional</emphasis>
   se llama <parameter>strict</parameter>. Todos los par&aacute;metros
   opcionales se encuentran entre <emphasis>[</emphasis> corchetes
   <emphasis>]</emphasis>. El manual define que el parametro
   <parameter>strict</parameter> por defecto retorna
   &false;. Consultar el manual para obtener detalles de como las
   diferentes funciones funcionan.
  </para>
 </sect1>
 
 <sect1 id="about.phpversions">
  <title>Versiones de PHP documentadas en este manual</title>
  <para>
   Esta documentaci&oacute;n contiene informacion sobre PHP 4, con
   algunas notas adicionales sobre migraci&oacute;n y compatibilidad
   con PHP 3. Comportamientos, par&aacute;metros, valores retornados y
   otros cambios entre diferentes versiones de PHP se encuentran
   documentados en notas en este manual.
  </para>
  <para>
   Podeis encontrar trozos de documentaci&oacute;n para la
   versi&oacute;n CVS de PHP, esto significa la &uacute;ltima
   versi&oacute;n de desarrollo disponible por el momento. Si no eres
   un desarrollador de PHP &oacute; no utilizas la &uacute;ltima
   versi&oacute;n de PHP en el CVS, no tendras disponibles las
   caracter&iacute;sticas marcadas con "disponible en el CVS". De
   todas maneras, estas caracter&iacute;sticas estar&aacute;n
   probablemente disponibles en la proxima versi&oacute;n estable de
   PHP. Si deseais bajaros la versi&oacute;n del CVS, consultar la
   p&aacute;gina sobre <ulink url="&url.php.anoncvs;">acceso
   an&oacute;nimo al CVS</ulink>.
  </para>
  <para>
   Tambi&eacute;n podeis encontrar documentaci&oacute;n sobre una
   versi&oacute;n de PHP que no est&eacute; publicada todavia (p.ej
   PHP 5.0.0 cuando la &uacute;ltima versi&oacute;n estable es
   4.3.0). La mayoria de las veces no es un fallo. La
   explicaci&oacute;n es a&ntilde;adida para caracter&iacute;sticas
   que se sabe estar&aacute;n disponibles en una versi&oacute;n futura
   de PHP.
  </para>
 </sect1>
 
 
 <sect1 id="about.more">
  <title>Como encontrar m&aacute;s informaci&oacute;n sobre PHP</title>
  <para>
   Este manual no pretende explicar practicas generales de
   programaci&oacute;n. Si vas a empezar a programar &oacute; eres un
   programador principiante, seguramente tendras dificultades para
   aprender a programar en PHP usando solamente este manual. Te
   ser&aacute; de gran ayuda utilizar otros textos m&aacute;s
   orientados a principiantes. Una lista con libros sobre PHP puede
   encontrarse en <ulink
   url="&url.php.books;">&url.php.books;</ulink>.
  </para>
  <para>
   Existen una serie de listas de correo en donde se puede discutir
   sobre diferentes aspectos relacionados con la programaci&oacute;n
   en PHP. Si tienes un problema, el cual no puedes solucionar, puedes
   usar estas listas para preguntar y obtener ayuda. Una lista con las
   listas de correo disponibles puede encontrarse en <ulink
   url="&url.php.support;">&url.php.support;</ulink>, asi como enlaces
   a los archivos historicos de estas listas y otros recursos de ayuda
   en l&iacute;nea. Adem&aacute;s en <ulink
   url="&url.php.links;">&url.php.links;</ulink> puedes encontrar
   informaci&oacute;n sobre servidores web dedicados a PHP,
   art&iacute;culos, foros y galerias de c&oacute;digo.
  </para>
 </sect1>

 <sect1 id="about.howtohelp">
  <title>Como ayudar a mejorar la documentaci&oacute;n</title>
  <para>
   Se pueden ayudar de tres maneras a mejorar esta documentci&oacute;n.
  </para>
  <para>
   Si encontrais errores en este manual, en cualquier lenguaje, podeis
   informar sobre el mismo, usando el sistema de informes de errores en 
   <ulink url="&url.php.bugs;">&url.php.bugs;</ulink>. Clasificar el error
   como "Documentation Problem". Problemas encontrados con los diferentes
   formatos tambien se pueden mandar usando este sistema.
  </para>
  <note>
   <para>
    Por favor, no abusar del sistema de informes de errores mandando peticiones
    de ayuda. Utilizar las listas de correos y recursos mencionados anteriormente.
   </para>
  </note>
  <para>
   Contribuyendo con notas/comentarios, podeis dar ejemplos adicionales y aclaraciones
   a otros lectores. Pero no mandar informes de errores mediante el sistema de notas/comentarios.
   Podeis leer m&aacute;s sobre notas/comentarios en la secci&oacute;n <link
   linkend="about.notes">'Sobre las notas de usuarios'</link> de este apendice.
  </para>
  <para>
   Si sabes ingles y otro idioma, podeis ayudar en las traducciones. Si te
   interesa comenzar una nueva traducci&oacute;n o ayudar una existente, pasate
   por <ulink url="&url.php.dochowto;">&url.php.dochowto;</ulink>.
  </para>
 </sect1>
 
 <sect1 id="about.generate">
  <title>Como generamos los formatos</title>
  <para>
   This manual is written in <acronym>XML</acronym> using the <ulink
   url="&url.docbook.xml;">DocBook XML DTD</ulink>, using <ulink
   url="&url.dsssl;"><acronym>DSSSL</acronym></ulink> (Document
   Style and Semantics Specification Language) for formatting, and
   experimentally the <ulink url="&url.xslt;"><acronym>XSLT</acronym>
   </ulink> (Extensible Stylesheet Language Transformations)
   for maintenance and formatting.
  </para>
  <para>
   Usando <acronym>XML</acronym> como c&oacute;digo fuente, podemos
   generar diferentes formatos, manteniendo solamente un solo
   c&oacute;digo fuente para todos los formatos. Las herramientas
   utilizadas para crear las versiones <acronym>HTML</acronym> y
   <acronym>TeX</acronym> son <ulink url="&url.jade;">Jade</ulink>,
   escrito por <ulink url="&url.jclark;">James Clark</ulink> y
   <ulink url="&url.dbstyle;">The Modular DocBook Stylesheets</ulink>, 
   escrito por <ulink url="&url.nwalsh;">Norman Walsh</ulink>.
   Usamos <ulink url="&url.winhelp;">Microsoft HTML Help Workshop</ulink>
   para generar el formato de ayuda Windows HTML y por supuesto PHP
   para algunas conversiones y preprocesado.
  </para>
  <para>
   Puedes bajarte el manual en diferentes idiomas y formatos, 
   incluyendo texto plano, <acronym>HTML</acronym>,<acronym>PDF</acronym>, 
   PalmPilot DOC, PalmPilot iSilo y Windows HTML Help, de 
   <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
   Los manuales son generados automaticamente a medida que el 
   c&oacute;digo fuente se va actualizando.
  </para>
  <para>
   M&aacute;s informaci&oacute;n sobre como bajarse el c&oacute;digo fuente en <acronym>XML</acronym>
   en <ulink url="&url.php.cvs;">&url.php.cvs;</ulink>. La documentaci&oacute;n
   se encuentra en el m&oacute;dulo <literal>phpdoc</literal>
  </para>
 </sect1>

 <sect1 id="about.translations">
  <title>Traducciones</title>
  <para>
   El manual de PHP no est&aacute; disponible solamente en diferentes
   formatos, tambien se encuentra en diferentes idiomas. El manual es
   escrito primero en ingles y luego grupos de traductores de todo el
   mundo se encargan de mantener la traducci&oacute;n a su idioma
   sincronizada con la versi&oacute;n inglesa. Si la traducci&oacute;n
   de alg&uacute;n apartado del manual no ha sido realizada todavia
   por el equipo de traductores, este aparecer&aacute; en ingles hasta
   que sea traducido.
  </para>
  <para>
   Las personas involucradas en las traducciones, utilizan el
   c&oacute;digo fuente en <acronym>XML</acronym> disponible en <ulink
    url="&url.php.cvs;">&url.php.cvs;</ulink> y lo traducen a su
   idioma. <emphasis>No utilizan</emphasis> la versi&oacute;n en
   <acronym>HTML</acronym>, texto plano &oacute;
   <acronym>PDF</acronym>. Es el sistema de generaci&oacute;n de
   formatos el que se encarga de producirlos a partir de
   <acronym>XML</acronym>.
  </para>
  <note>
   <para>
    Si te interesa ayudar &oacute; participar en la traducci&oacute;n
    de la documentaci&oacute;n a tu idioma, ponte en contacto con el
    equipo de traducci&oacute;n/documentaci&oacute;n apuntandote la la
    lista de correo phpdoc. Manda un mensaje vacio a <ulink
    url="mailto:&email.php.doc.subscribe;">&email.php.doc.subscribe;</ulink>.
    La direcci&oacute;n de la esta lista de correo es
    <literal>&email.php.doc;</literal>.  Explica que est&aacute;s
    interesado en traducir el manual a un idioma y nos pondremos en
    contacto contigo, te mandaremos informaci&oacute;n para que puedas
    empezar una nueva traducci&oacute;n o para que pases a formar
    parte del equipo de traducci&oacute;n de tu idioma, si este ya
    existe.  </para>
  </note>
  <para>
   Por el momento existen traducciones, completas o parciales, en los
   siguientes idiomas: Brasile&ntilde;o, Portugues, Chino
   (simplificado), Chino (Tradicional), Checo, Holand&eacute;s,
   Finland&eacute;s, Frances, Alem&aacute;n, Hebreo, Hungaro,
   Italiano, Japones, Koreano, Polaco, Rumano, Ruso, Eslovaco,
   Espa&ntilde;ol, Sueco y Turco.
  </para>
  <para>
   Todas ellas se pueden bajar de: <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
  </para>
 </sect1>
  <sect1 id="about.thistranslations">
  <title>Sobre la traducci&oacute;n al espa&ntilde;ol</title>
  <para>
   El proyecto de traducci&oacute;n de la documantaci&oacute;n de PHP
   al espa&ntilde;ol tiene una p&aacute;gina web en la que
   podr&aacute;s encontrar informaci&oacute;n sobre el mismo,
   historia, que se necesita para colaborar, guia para los
   colaboradores, reglas y convenciones de traducci&oacute;n, listas de correos,
   acceso a la documentaci&oacute;n y a los colaboradores de la
   traducci&oacute;n, etc. La direcci&oacute;n es <ulink
   url="http://www.linux-es.com/PHP/">http://www.linux-es.com/PHP/</ulink>
  </para>
  <para>
    La traducci&oacute;n del manual de PHP al espa&ntilde;ol ha sido
    posible gracias a la colaboraci&oacute;n de un gran n&uacute;mero
    de traductores, que desinteresadamente han usado su tiempo para
    que todos podamos tener una versi&oacute;n en nuestra lengua de
    esta documentaci&oacute;n.
  </para>
  <para>
   El coordinador de la traducci&oacute;n es <ulink
   url="mailto:&email.rafael;">Rafael Martinez</ulink> podeis
   contactar con el, para cualquier duda relacionada con el proyecto
   de traducci&oacute;n. Los colaboradores los podeis encontrar en
   esta lista:
  </para>
  </sect1>

</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
