<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.1 $ -->

<!--
  TODO: add manual conventions section (eg. how to read
        function usage parts, what is fixed width, what is
        bold, what is linked
        
        add some tips about combining the versions (online-
        offline), and using "http://anymirror.php.net/funcname"
-->
<appendix id="about">
 <title>Sobre el manual</title>

 <sect1 id="about.formats">
  <title>Formatos</title>
  <para>
   El manual de PHP se encuentra disponible en diferentes formatos. Estos formatos
   se pueden dividir en dos grupos: formatos accesible en l&iacute;nea (online) y ficheros 
   que se pueden bajar a tu ordenador.
  </para>
  <note>
   <para>
    Algunos editores han publicado versiones impresas de este manual. No podemos
    recomendar ninguna de ellas, ya que suelen quedarse obsoletas r&aacute;pidamente.
   </para>
  </note>
  <para>
   Podeis leer el manual en linea (online) en <ulink url="&url.php;"> &url.php;</ulink>
   y en numerosos servidores espejo. Para mejorar la respuesta, deberiais
   utilizar el servidor espejo m&aacute;s cercano a vosotros. Podeis consultar el manual
   en formato HTML -impresi&oacute;n amigable- &oacute; en formato HTML que integra el manual
   en el diseno de la p&aacute;gina web del proyecto PHP.
  </para>
  <para>
   Una ventaja del manual en l&iacute;nea sobre la mayoria de formatos fuera de l&iacute;nea es
   la integraci&oacute;n de los <link linkend="about.notes">comentarios/notas de usuarios</link>.
   Una desventaja es que teneis que estar conectados para ver consultar las versiones
   en l&iacute;nea.
  </para>
  <para>
   Existen varios formatos fuera de l&iacute;nea y el m&aacute;s apropiado para cada usuario
   depende del sistema operativo que se use y de tus preferencias a la hora de leer.
   Informacion sobre como el manual es generado en tantos formatos diferentes
   se puede obtener en la seccion de este apendice titulada <link linkend="about.generate">
   'Como generamos los dierentes formatos'</link>.
  </para>
  <para>
   Los formatos m&aacute;s accesibles desde diferentes plataformas son HTML y texto plano.
   el manual en HTML se proporciona como un unico fichero en HTML &oacute; como un paquete
   con un fichero HTML por secci&oacute;n. Los formatos HTML y texto plano se distribuyen
   como ficheros tar y con compresi&oacute;n bz2.
  </para>
  <para>
   Otro formato muy popular y el m&aacute;s adecuado para imprimir, es PDF (Adobe Acrobat). 
   Tenemos que advertir antes que empeceis a imprimir que el manual contiene 
   casi 2000 p&aacute;ginas y se revisa constantemente.  
  </para>
  <note>
   <para>
    Si no teneis un programa capaz de presentar ficheros PDF, podeis bajaros 
    <ulink url="&url.adobe.acrobat;">Adobe Acrobat Reader</ulink>.
   </para>
  </note>
  <para>
   Los usuarios de ordenadores de mano compatibles con Palm, tienen los formatos
   Palm doc y iSilo. Podreis utlizar un lector de documentos <ulink url="&url.palm.doc;">
   DOC</ulink> &oacute; <ulink url="&url.palm.isilo;">iSilo</ulink> para consultar
   la documentaci&oacute;n de PHP o como referencia r&aacute;pida.
  </para>
  <para>
   Para plataformas Windows, la versi&oacute;n Windows HTML Ayuda proporciona el formato
   HTML usado con la aplicacion de ayuda Windows HTML. Esta versi&oacute;n proporciona
   busqueda completa de texto, indice completo y marcas (bookmarks). Muchos entornos 
   de desarrollo para PHP en Windows integran esta versi&oacute;n. 
  </para>
  <note>
   <para>
    Un projecto de Visual Basic para Linux se encuentra en fase de planificaci&oacute;n, 
    incluir&aacute; la creaci&oacute;n de "CHM Creator and Viewer" para Linux. Podeis consultar
    la p&aacute;gina en <ulink url="&url.vb4linux;">SourceForge.net</ulink> si estais
    interesados en su progreso.
   </para>
  </note>
 </sect1>
 
 <sect1 id="about.notes">
  <title>Sobre las notas de usuarios</title>
  <para>
   Las notas de usuarios juegan un importante papael en el desarrollo de este manual.
   Permitiendo a los lectores del manual contribuir con ejemplos y aclaraciones 
   desde su navegador, podemos incorporar estas aclaraciones en el manual. Hasta que
   las notas son incorporadas en el manual, pueden ser accedidas desde el manual en l&iacute;nea
   y algunos formatos fuera de l&iacute;nea.
  </para>
  <note>
   <para>
    Las notas de usuario no son moderadas antes de estar disponibles en l&iacute;nea, 
    asi que la calidad de lo escrito asi como los ejemplos &oacute; incluso la veracidad
    de lo expuesto en la nota no puede ser garantizada.
   </para>
  </note>
 </sect1>
 
 <sect1 id="about.more">
  <title>Como encontrar m&aacute;s informaci&oacute;n sobre PHP</title>
  <para>
   Este manual no pretende explicar practicas generales de programaci&oacute;n. Si 
   vas a empezar a programar &oacute; eres un programador principiante, seguramente
   tendras dificultades para aprender a programar en PHP usando solamente
   este manual. Te ser&aacute; de gran ayuda utilizar otros textos m&aacute;s orientados 
   a principiantes. Una lista con libros sobre PHP puede encontrarse en
   <ulink url="&url.php.books;">&url.php.books;</ulink>.
  </para>
  <para>
   Existen una serie de listas de correo en donde se puede discutir sobre
   diferentes aspectos relacionados con la programaci&oacute;n en PHP. Si tienes
   un problema, el cual no puedes solucionar, puedes usar estas listas para
   preguntar y obtener ayuda. Una lista con las listas de correo disponibles
   puede encontrarse en <ulink url="&url.php.support;">&url.php.support;</ulink>, 
   asi como enlaces a los archivos historicos de estas listas y otros recursos
   de ayuda en l&iacute;nea. Adem&aacute;s en <ulink url="&url.php.links;">&url.php.links;</ulink>
   puedes encontrar informaci&oacute;n sobre servidores web dedicados a PHP, art&iacute;culos, foros
   y galerias de c&oacute;digo.
  </para>
 </sect1>

 <sect1 id="about.howtohelp">
  <title>Como ayudar a mejorar la documentaci&oacute;n</title>
  <para>
   Se pueden ayudar de tres maneras a mejorar esta documentci&oacute;n.
  </para>
  <para>
   Si encontrais errores en este manual, en cualquier lenguaje, podeis
   informar sobre el mismo, usando el sistema de informes de errores en 
   <ulink url="&url.php.bugs;">&url.php.bugs;</ulink>. Clasificar el error
   como "Documentation Problem". Problemas encontrados con los diferentes
   formatos tambien se pueden mandar usando este sistema.
  </para>
  <note>
   <para>
    Por favor, no abusar del sistema de informes de errores mandando peticiones
    de ayuda. Utilizar las listas de correos y recursos mencionados anteriormente.
   </para>
  </note>
  <para>
   Contribuyendo con notas/comentarios, podeis dar ejemplos adicionales y aclaraciones
   a otros lectores. Pero no mandar informes de errores mediante el sistema de notas/comentarios.
   Podeis leer m&aacute;s sobre notas/comentarios en la secci&oacute;n <link
   linkend="about.notes">'Sobre las notas de usuarios'</link> de este apendice.
  </para>
  <para>
   Si sabes ingles y otro idioma, podeis ayudar en las traducciones. Si te
   interesa comenzar una nueva traducci&oacute;n o ayudar una existente, pasate
   por <ulink url="&url.php.dochowto;">&url.php.dochowto;</ulink>.
  </para>
 </sect1>
 
 <sect1 id="about.generate">
  <title>Como generamos los formatos</title>
  <para>
   This manual is written in <acronym>XML</acronym> using the <ulink
   url="&url.docbook.xml;">DocBook XML DTD</ulink>, using <ulink
   url="&url.dsssl;"><acronym>DSSSL</acronym></ulink> (Document
   Style and Semantics Specification Language) for formatting, and
   experimentally the <ulink url="&url.xslt;"><acronym>XSLT</acronym>
   </ulink> (Extensible Stylesheet Language Transformations)
   for maintenance and formatting.
  </para>
  <para>
   Usando <acronym>XML</acronym> como c&oacute;digo fuente, podemos
   generar diferentes formatos, manteniendo solamente un solo
   c&oacute;digo fuente para todos los formatos. Las herramientas
   utilizadas para crear las versiones <acronym>HTML</acronym> y
   <acronym>TeX</acronym> son <ulink url="&url.jade;">Jade</ulink>,
   escrito por <ulink url="&url.jclark;">James Clark</ulink> y
   <ulink url="&url.dbstyle;">The Modular DocBook Stylesheets</ulink>, 
   escrito por <ulink url="&url.nwalsh;">Norman Walsh</ulink>.
   Usamos <ulink url="&url.winhelp;">Microsoft HTML Help Workshop</ulink>
   para generar el formato de ayuda Windows HTML y por supuesto PHP
   para algunas conversiones y preprocesado.
  </para>
  <para>
   Puedes bajarte el manual en diferentes idiomas y formatos, 
   incluyendo texto plano, <acronym>HTML</acronym>,<acronym>PDF</acronym>, 
   PalmPilot DOC, PalmPilot iSilo y Windows HTML Help, de 
   <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
   Los manuales son generados automaticamente a medida que el 
   c&oacute;digo fuente se va actualizando.
  </para>
  <para>
   M&aacute;s informaci&oacute;n sobre como bajarse el c&oacute;digo fuente en <acronym>XML</acronym>
   en <ulink url="&url.php.cvs;">&url.php.cvs;</ulink>. La documentaci&oacute;n
   se encuentra en el m&oacute;dulo <literal>phpdoc</literal>
  </para>
 </sect1>

 <sect1 id="about.translations">
  <title>Traducciones</title>
  <para>
   El manual de PHP no est&aacute; disponible solamente en diferentes formatos, 
   tambien se encuentra en diferentes idiomas. El manual es escrito
   primero en ingles y luego grupos de traductores de todo el mundo
   se encargan de mantener la traducci&oacute;n a su idioma sincronizada con la
   versi&oacute;n inglesa. Si la traducci&oacute;n de alg&uacute;n apartado del manual no ha sido
   realizada todavia por el equipo de traductores, este aparecer&aacute; en ingles
   hasta que sea traducido. 
  </para>
  <para>
   Las personas involucradas en las traducciones, utilizan el c&oacute;digo fuente
   en <acronym>XML</acronym> disponible en <ulink url="&url.php.cvs;">&url.php.cvs;</ulink>
   y lo traducen a su idioma. <emphasis>No utilizan</emphasis> la versi&oacute;n en
   <acronym>HTML</acronym>, texto plano &oacute; <acronym>PDF</acronym>. Es el sistema 
   de generaci&oacute;n de formatos el que se encarga de producirlos a partir de <acronym>XML</acronym>.
  </para>
  <note>
   <para>
    Si te interesa ayudar &oacute; participar en la traducci&oacute;n de la documentaci&oacute;n a tu
    idioma, ponte en contacto con el equipo de traducci&oacute;n/documentaci&oacute;n apuntandote
    la la lista de correo phpdoc. Manda un mensaje vacio a <ulink
    url="mailto:&email.php.doc.subscribe;">&email.php.doc.subscribe;</ulink>.
    La direcci&oacute;n de la esta lista de correo es <literal>&email.php.doc;</literal>.
    Explica que est&aacute;s interesado en traducir el manual a un idioma y nos pondremos
    en contacto contigo, te mandaremos informaci&oacute;n para que puedas empezar una
    nueva traducci&oacute;n o para que pases a formar parte del equipo de traducci&oacute;n de tu
    idioma, si este ya existe.
   </para>    
  </note>
  <para>
   Por el momento existen traducciones, completas o en parciales, en los siguientes
   idiomas: Brasileño, Portugues, Checo, Holand&eacute;s, Finland&eacute;s, Frances, Alem&aacute;n, 
   Hungaro, Italiano, Japones, Koreano, Polaco, rumano, Ruso, Español y Turco. 
  </para>
  <para>
   Todas ellas se pueden bajar de: <ulink url="&url.php.docs;">&url.php.docs;</ulink>.
  </para>
 </sect1>
  <sect1 id="about.thistranslations">
  <title>Sobre la traducci&oacute;n al español</title>
  <para>
   El proyecto de traducci&oacute;n de la documantaci&oacute;n de PHP al español tiene una p&aacute;gina web
   en la que podras encontrar informaci&oacute;n sobre el mismo, historia, como colaborar, acceso
   a la documentaci&oacute;n y a los colaboradores de la traducci&oacute;n. La direcci&oacute;n es 
   <ulink url="http://www.linux-es.com/PHP/">http://www.linux-es.com/PHP/</ulink> 
  </para>
  <para>
    La traducci&oacute;n del manual de PHP al español ha sido posible gracias a la colaboraci&oacute;n de un 
    gran n&uacute;mero de traductores, que desinteresadamente han usado su tiempo para que todos podamos 
    tener una versi&oacute;n en nuestra lengua de esta documentaci&oacute;n. 
  </para>
  <para>
   El coordinador de la traducci&oacute;n es <ulink url="mailto:&email.rafael;">Rafael Martinez</ulink> 
   y los colaboradores los podeis encontrar en esta lista:
  </para>
  </sect1>

</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
