<?xml version="1.0" encoding="iso-8859-1"?>
<!-- $Revision: 1.9 $ -->
<!-- EN-Revision: 1.22 Maintainer: rafael Status: ready -->

<appendix xml:id="history" xmlns="http://docbook.org/ns/docbook" xmlns:xlink="http://www.w3.org/1999/xlink">
 <title>Historia de PHP y proyectos relacionados</title>
 <para>
  PHP ha recorrido un largo camino en los &uacute;ltimos a&ntilde;os.
  Crecer hasta ser uno de los m&aacute;s importantes lenguajes de
  programaci&oacute;n en entornos Web no ha sido tarea f&aacute;cil.
  Aquellos interesados en ver brevemente c&oacute;mo creci&oacute; PHP
  hasta lo que es hoy en d&iacute;a, sigan leyendo. Antiguas versiones
  de PHP est&aacute;n disponibles en el <link
  xlink:href="&url.php.museum;">Museo PHP</link>.
 </para>

 <sect1 xml:id="history.php">
  <title>Historia de  PHP</title>

  <sect2 xml:id="history.phpfi">
   <title>PHP/FI</title>
   <para>
    PHP es el heredero de un producto anterior, llamado PHP/FI.
    PHP/FI fue creado por Rasmus Lerdorf en 1995, inicialmente como un
    simple conjunto de scripts de Perl para controlar los accesos a su
    trabajo online.  Llam&oacute; a ese conjunto de scripts 'Personal
    Home Page Tools'.  Seg&uacute;n se requer&iacute;a m&aacute;s
    funcionalidad, Rasmus fue escribiendo una implementaci&oacute;n C
    mucho mayor, que era capaz de comunicarse con bases de datos, y
    permit&iacute;a a los usuarios desarrollar sencillas aplicaciones
    Web din&aacute;micas. Rasmus eligi&oacute; <link
    xlink:href="&url.php.release1.0.0;">liberar</link> el c&oacute;digo
    fuente de PHP/FI para que cualquiera pudiese utilizarlo,
    as&iacute; como arreglar errores y mejorar el c&oacute;digo.
   </para>
   <para>
    PHP/FI, que se mantuvo para p&aacute;ginas personales  y como int&eacute;rprete
    de formularios, inclu&iacute;a algunas de las funcionalidads b&aacute;sicas de PHP
    tal y como lo conocemos hoy. Ten&iacute;a variables como las de Perl, interpretaci&oacute;n
    autom&aacute;tica de variables de formulario y sintaxis embebida HTML.
    La sintaxis por s&iacute; misma era similar a la de Perl, aunque mucho
    m&aacute;s limitada, simple y algo inconsistente.
   </para>
   <para>
    Por 1997, PHP/FI 2.0, la segunda escritura de la implementaci&oacute;n en C,
    tuvo un seguimiento estimado de varios miles de usuarios en todo el mundo,
    con aproximadamente 50.000 dominios informando que lo ten&iacute;an
    instalado, sumando alrededor del 1% de los dominios
    de Internet. Mientras hab&iacute;a mucha gente contribuyendo
    con bits de c&oacute;digo a este proyecto, era todav&iacute;a en su mayor parte el
    proyecto de una sola persona.
   </para>
   <para>
    PHP/FI 2.0 no se liber&oacute; oficialmente hasta Noviembre de 1997,
    despu&eacute;s de gastar la mayor&iacute;a de su vida en desarrollos beta.
    Fue sucedido en breve tiempo por las primeras versiones alfa de PHP 3.0.
   </para>
  </sect2>

  <sect2 xml:id="history.php3">
   <title>PHP 3</title>
   <para>
    PHP 3.0 era la primera versi&oacute;n que se parec&iacute;a
    fielmente al PHP tal y como lo conocemos hoy en d&iacute;a. Fue
    creado por Andi Gutmans y Zeev Zuraski en 1997
    reescribi&eacute;ndolo completamente, despu&eacute;s de que
    encontraran que PHP/FI 2.0 ten&iacute;a pocas posibilidades para
    desarrollar una aplicaci&oacute;n comercial que estaban
    desarrollando para un projecto universitario. En un esfuerzo para
    cooperar y empezar a construir sobre la base de usuarios de PHP/FI
    existente, Andi, Rasmus y Zeev decidieron cooperar y anunciar PHP
    3.0 como el sucesor oficial de PHP/FI 2.0, interrumpi&eacute;ndose
    en su mayor parte el desarrollo de PHP/FI 2.0.
   </para>
   <para>
    Una de las mejores caracter&iacute;sticas de PHP 3.0 era su
    gran extensibilidad. Adem&aacute;s de proveer a los usuarios finales
    de una s&oacute;lida infraestructura para much&iacute;simas
    bases de datos, protocolos y APIs, las caracter&iacute;sticas de
    extensibilidad de PHP 3.0 atrajeron a docenas de desarrolladores
    a unirse y enviar nuevos m&oacute;dulos de extensi&oacute;n. Sin duda,
    &eacute;sta fue la clave del enorme &eacute;xito de PHP 3.0. Otras caracter&iacute;sticas
    clave introducidas en PHP 3.0 fueron el soporte de sint&aacute;xis
    orientado a objetos y una sint&aacute;xis de lenguaje mucho m&aacute;s potente
    y consistente.
   </para>
   <para>
    Todo el nuevo lenguaje fue liberado bajo un nuevo nombre,
    que borraba la implicaci&oacute;n de uso personal limitado que ten&iacute;a el
    nombre PHP/FI 2.0. Se llam&oacute; 'PHP' a secas, con el significado
    de ser un acr&oacute;nimo recursivo - PHP: Hypertext Preprocessor.
   </para>
   <para>
    A finales de 1998, PHP creci&oacute; hasta una base de instalaci&oacute;n de
    decenas de millares de usuarios (estimados) y cientos de miles de
    sitios Web informando de su instalaci&oacute;n. En su apogeo, PHP 3.0
    estaba instalado en aproximadamente un 10% de los servidores Web
    en Internet.
   </para>
   <para>
    PHP 3.0 se liber&oacute; oficialmente en Junio de 1998, despu&eacute;s
    de haber gastado unos 9 meses en pruebas p&uacute;blicas.
   </para>
  </sect2>

  <sect2 xml:id="history.php4">
   <title>PHP 4</title>
   <para>
    En el invierno de 1998, poco despu&eacute;s del lanzamiento oficial
    de PHP 3.0, Andi Gutmans y Zeev Suraski comenzaron a
    trabajar en la reescritura del n&uacute;cleo de PHP. Los objetivos
    de dise&ntilde;o fueron mejorar la ejecuci&oacute;n de aplicaciones
    complejas, y mejorar la modularidad del c&oacute;digo base de PHP.
    Estas aplicaciones se hicieron posibles por las nuevas
    caracter&iacute;sticas de PHP 3.0 y el apoyo de una gran variedad
    de bases de datos y APIs de terceros, pero PHP 3.0
    no fue dise&ntilde;ado para el mantenimiento tan complejo de
    aplicaciones eficientemente.
   </para>
   <para>
    El nuevo motor, apodado 'Motor Zend' (comprimido de sus
    apellidos, Zeev y Andi), alcanz&oacute; estos objetivos de
    dise&ntilde;o satisfactoriamente, y se introdujo por primera vez a
    mediados de 1999. PHP 4.0, basado en este motor, y acoplado
    con un gran rango de nuevas caracter&iacute;sticas adicionales, fue
    oficialmente liberado en Mayo de 2000, casi dos a&ntilde;os despu&eacute;s
    que su predecesor, PHP 3.0. Adem&aacute;s de la mejora
    de ejecuci&oacute;n de esta versi&oacute;n, PHP 4.0 inclu&iacute;a otras caracter&iacute;sticas
    clave como el soporte para la mayor&iacute;a de los servidores Web,
    sesiones HTTP, buffers de salida, formas m&aacute;s seguras
    de controlar las entradas de usuario y muchas nuevas construcciones
    de lenguaje.
   </para>
   <para>
    PHP 4 es actualmente la &uacute;ltima versi&oacute;n liberada de PHP. Ya se
    est&aacute; trabajando en modificar y mejorar el motor Zend
    para integrar las caracter&iacute;sticas que se dise&ntilde;ar&iacute;an para PHP 5.0.
   </para>
   <para>
    Hoy, se estima que PHP es usado por cientos de miles de programadores
    y muchos millones de sitios informan que lo tienen instalado,
    sumando m&aacute;s del 20% de los dominios en Internet.
   </para>
   <para>
    El equipo de desarrollo de PHP incluye docenas de programadores,
    as&iacute; como otras docenas de personas trabajando en proyectos relacionados con
    PHP como PEAR y el proyecto de documentaci&oacute;n.
   </para>
  </sect2>

  <sect2 xml:id="history.php5">
   <title>PHP 5</title>
   <para>
    El futuro de PHP est&aacute; dirigido por su n&uacute;cleo, el motor Zend. PHP 5
    incluira el nuevo motor Zend 2.0. Para obtener m&aacute;s informaci&oacute;n
    sobre este motor, consultar su<link xlink:href="&url.zend.future;">
    p&aacute;gina web</link>.
   </para>
  </sect2>

 </sect1>

 <sect1 xml:id="history.php.related">
  <title>Historia de los proyectos relacionados con PHP</title>

  <!-- Hope Stig and/or Egon can do this

  <sect2 xml:id="history.phpdoc">
   <title>PHP Documentation Project</title>
   <para>
   </para>
  </sect2>

  -->

  <sect2 xml:id="history.pear">
   <title>PEAR</title>
   <para>
    <link xlink:href="&url.php.pear;">PEAR</link>, el PHP Extension and
    Application Repository (originalmente, PHP Extension and Add-on
    Repository) es la versi&oacute;n de clases de creaci&oacute;n de
    PHP, y puede crecer en el futuro para ser una de las v&iacute;as
    clave para distribuir tanto PHP como extensiones PHP basados en C
    entre desarrolladores.
   </para>
   <para>
    PEAR naci&oacute; de las discusiones mantenidas en el PHP Developers'
    Meeting (PDM) transcurrido en Enero de 2000 en Tel Aviv. Fue
    creado por Stig S. Bakken, y lo dedic&oacute; a su primog&eacute;nita, Malin Bakken.
   </para>
   <para>
    Hasta principios de 2000, PEAR fue creciendo hasta ser un gran y
    significativo proyecto con un gran n&uacute;mero de programadores
    trabajando en la implementaci&oacute;n com&uacute;n, funcionalidad reutilizable
    para el beneficio de toda la comunidad PHP. PEAR hoy incluye
    una gran variedad de clases de infraestructura
    para acceso a bases de datos, cach&eacute; de contenido, c&aacute;lculos
    matem&aacute;ticos, comercio electr&oacute;nico y mucho m&aacute;s.
   </para>
    <para>
    M&aacute;s informaci&oacute;n sobre PEAR se puede encontrar en <link
    xlink:href="&url.php.pear.manual;">el manual de PEAR</link>.
   </para>
  </sect2>

  <sect2 xml:id="history.phpqa">
   <title>Iniciativa para la Garant&iacute;a de Calidad de PHP</title>
   <para>
    La <link xlink:href="&url.php.prerelease;">Iniciativa para la
    Garant&iacute;a de Calidad de PHP</link> se configur&oacute; en
    el verano de 2000 en respuesta a los que criticaban que las
    versiones de PHP se liberaban sin que fueran comprobadas
    suficientemente para entornos de producci&oacute;n. El equipo
    ahora consiste en un grupo central de desarrolladores con un buen
    entendimiento del c&oacute;digo base de PHP. Estos desarrolladores
    gastan mucho tiempo localizando y solucionando problemas con PHP.
    Adem&aacute;s, hay muchos miembros de otros equipos que testean y
    prueban estas soluciones usando una gran variedad de plataformas.
   </para>
  </sect2>

  <sect2 xml:id="history.phpgtk">
   <title>PHP-GTK</title>
   <para>
    <link xlink:href="&url.php.gtk;">PHP-GTK</link> es la soluci&oacute;n
    PHP para escribir las aplicaciones GUI del lado del
    cliente. Andrei Zmievski recuerda la planificaci&oacute;n y la
    creaci&oacute;n del proceso de PHP-GTK:
   </para>
   <blockquote>
    <para>
     Programar GUI siempre ha estado entre mis intereses, y
     he encontrado que Gtk+ es una herramienta muy buena,
     salvo que programar con ella en C es algo tedioso. Tras
     presenciar las implementaciones de PyGtk y GTK-Perl,
     decid&iacute; ver si PHP se podr&iacute;a hacer con la interfaz Gtk+,
     incluso m&iacute;nimamente. En Agosto de 2000
     empec&eacute; a tener m&aacute;s tiempo libre, con lo que comenc&eacute;
     a experimentar. Mi principal gu&iacute;a fue la implementaci&oacute;n
     PyGtk con caracter&iacute;sticas completas bastante buenas
     y con un buen interfaz orientado a objetos. James Henstridge,
     el autor de PyGtk, provey&oacute; mucha ayuda adicional durante
     esos estados iniciales.
    </para>
    <para>
     Escribir las interfaces de todas las funciones Gtk+ estaba fuera
     de cuesti&oacute;n, por lo que mantuve la idea de generador de c&oacute;digo,
     similar a c&oacute;mo PyGtk lo hizo. El generador de c&oacute;digo es un
     programa PHP que lee un conjunto de ficheros .defs que contienen
     las clases Gtk+, constantes e informaci&oacute;n de m&eacute;todos y genera
     c&oacute;digo C que interact&uacute;a PHP con ellos. Lo que no se puede
     generar autom&aacute;ticamente puede escribirse a mano en ficheros
     .overrides.
    </para>
    <para>
     Trabajar en el generador de c&oacute;digo y la infraestructura llev&oacute; algo
     de tiempo, porque pude dedicar poco tiempo a PHP-GTK durante
     el oto&ntilde;o de 2000. Despu&eacute;s mostr&eacute; PHP-GTK a Frank Kromann,
     que se interes&oacute; y empez&oacute; a ayudarme con el trabajo del generador
     de c&oacute;digo y con la implementaci&oacute;n para Win32. Cuando escribimos
     el primer programa Hola Mundo y funcion&oacute;, fue extremadamente
     excitante. Llev&oacute; un par de meses m&aacute;s llevar el proyecto a una condici&oacute;n
     presentable y la versi&oacute;n inicial se liber&oacute; el 1 de Marzo de 2001. La
     historia r&aacute;pidamente lleg&oacute; a SlashDot.
    </para>
    <para>
     Sintiendo que PHP-GTK podr&iacute;a extenderse, configur&eacute; listas
     de correo separadas y repositorios CVS para ello, as&iacute; como
     el sitio web gtk.php.net con la ayuda de Colin Viebrock. La
     documentaci&oacute;n tambi&eacute;n tuvo que hacerse y James Moore
     lleg&oacute; para ayudar en esto.
    </para>
    <para>
     Desde su lanzamiento PHP-GTK fue ganando popularidad.
     Tenemos nuestro propio equipo de documentaci&oacute;n, el manual
     sigue mejorando, la gente ha comenzado a escribir extensiones
     para PHP-GTK, y con ello m&aacute;s y mejores aplicaciones.
    </para>
   </blockquote>
  </sect2>
 </sect1>

 <sect1 xml:id="history.php.books">
  <title>Libros sobre PHP</title>
  <para>
   Seg&uacute;n crec&iacute;a PHP, empezo a ser reconocido como una popular
   plataforma de desarrollo web. Una de las m&aacute;s interesantes formas
   de ver esta tendencia era observando los libros sobre PHP que
   han ido llegando a lo largo de los a&ntilde;os.
  </para>
  <para>
   Por lo que nosotros sabemos, el primer libro dedicado a PHP fue
   'PHP - tvorba interaktivních internetových aplikací' - un libro
   checo publicado en 1999, cuyo autor fue Jirka Koseksiendo.  Al mes
   siguiente le siguio un libro alem&aacute;n cuyos autores fueron Egon
   Schmid, Christian Cartus y Richard Blume. El primer libro en
   ingl&eacute;s sobre PHP se public&oacute; poco despu&eacute;s, y
   fue 'Core PHP Programming' de Leon Atkinson. Los dos libros
   cubr&iacute;an PHP 3.0.
  </para>
  <para>
   Mientras estos libros fueron los primeros de su tipo - fueron
   seguidos por un gran n&uacute;mero de libros de una multitud de
   autores y editores. ¡Existen m&aacute;s 40 libros en ingl&eacute;s,
   50 libros en alem&aacute;n, y m&aacute;s de 20 libros en
   franc&eacute;s! Adem&aacute;s, se pueden encontrar libros sobre PHP
   en la mayor&iacute;a de las dem&aacute;s lenguas, incluyendo
   espa&ntilde;ol, coreano, japon&eacute;s y hebreo.
  </para>
  <para>
   Evidentemente, este gran n&uacute;mero de libros, escritos por diferentes
   autores, publicados por muchos editores, y  su disponibilidad en tantas
   lenguas - son un fuerte testimonio del &eacute;xito mundial de PHP.
  </para>
 </sect1>

 <sect1 xml:id="history.php.publications">
  <title>Publicaciones sobre PHP</title>
  <para>
   Por lo que sabemos, el primer art&iacute;culo sobre PHP en una
   revista impresa se public&oacute; en la version checa de
   Computerworld en la primavera de 1998, y cubr&iacute;a PHP
   3.0. Como con los libros, fue el primero en una serie de muchos
   art&iacute;culos publicados sobre PHP en varias revistas
   importantes.
  </para>
  <para>
   Art&iacute;culos sobre PHP han aparecido en Dr. Dobbs, Linux
   Enterprise, Linux Magazine y muchas otras. Art&iacute;culos sobre
   migraci&oacute;n de aplicaciones basadas en PHP bajo Windows ¡han
   aparecido incluso en el <acronym>MSDN</acronym> de Microsoft!
  </para>
 </sect1>

</appendix>

<!-- Keep this comment at the end of the file
Local variables:
mode: sgml
sgml-omittag:t
sgml-shorttag:t
sgml-minimize-attributes:nil
sgml-always-quote-attributes:t
sgml-indent-step:1a
sgml-indent-data:t
indent-tabs-mode:nil
sgml-parent-document:nil
sgml-default-dtd-file:"../../manual.ced"
sgml-exposed-tags:nil
sgml-local-catalogs:nil
sgml-local-ecat-files:nil
End:
vim600: syn=xml fen fdm=syntax fdl=2 si
vim: et tw=78 syn=sgml
vi: ts=1 sw=1
-->
